[
  {
    "question": "When did the author of \"Computing Machinery and Intelligence\" die?",
    "ground_truth": [
      "1954"
    ],
    "streamingllm_pred": "The author of \"Computing Machinery and Intelligence\" is Alan Turing, who died in 1954",
    "baseline_pred": "1954",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: 1984 Miami Dolphins season): 1984 Miami Dolphins season\nThe 1984 Miami Dolphins season was the team's 19th season, and 15th in the National Football League. It was also the 15th season with the team for head coach Don Shula. The Dolphins sought to build on a spectacular 1983 season where they went 12–4 with rookie quarterback Dan Marino, only to be upended by the Seattle Seahawks in the playoffs. \nThe Dolphins won the 1984 AFC Championship, and appeared in Super Bowl XIX, where they lost to the San Francisco 49ers, 38–16. To\n\nDocument (Title: Super Bowl XIX): criticized the referee's ruling of Freddie Solomon's fumble as an incomplete pass. \"You don't want the game to hinge on that play, but you never know,\" Blackwood said. \"I could have taken the ball up the sideline. That's a 14-point swing.\" However, other Dolphins were not convinced. \"We were dominated to the point where one play didn't make much of a difference,\" said Dolphins coach Don Shula. \"Our major objective was to contain Montana, and we did\n\nDocument (Title: Super Bowl XIX): Super Bowl XIX\nSuper Bowl XIX was an American football game between the American Football Conference (AFC) champion Miami Dolphins and the National Football Conference (NFC) champion San Francisco 49ers to decide the National Football League (NFL) champion for the 1984 season. The 49ers defeated the Dolphins by the score of 38–16, to win their second Super Bowl. The game was played on January 20, 1985, at Stanford Stadium, on the campus of Stanford University in Stanford, California, the first Super Bowl played in the\n\nQuestion: Who was the head coach of the team that lost Super Bowl XIX?\nAnswer: Don Shula\n\nDocument (Title: Sayidaty): Sayidaty\nSayidaty (Arabic سيدتي \"Sayyidatī\", meaning \"My Lady\" in English) is a weekly Arabic and a monthly English women's magazine published in both Dubai and Beirut and distributed throughout the Middle East, North Africa, Europe and America.\nHistory.\n\"Sayidaty <skip>  Artificial intelligence): Turing proposed that \"if a human could not distinguish between responses from a machine and a human, the machine could be considered \"intelligent\". The first work that is now generally recognized as AI was McCullouch and Pitts' 1943 formal design for Turing-complete \"artificial neurons\".\nThe field of AI research was born at a workshop at Dartmouth College in 1956. Attendees Allen Newell (CMU), Herbert Simon (CMU), John McCarthy (MIT), Marvin Minsky (MIT) and Arthur Samuel (\n\nDocument (Title: Artificial intelligence): began with philosophers and mathematicians in antiquity. The study of mathematical logic led directly to Alan Turing's theory of computation, which suggested that a machine, by shuffling symbols as simple as \"0\" and \"1\", could simulate any conceivable act of mathematical deduction. This insight, that digital computers can simulate any process of formal reasoning, is known as the Church–Turing thesis. Along with concurrent discoveries in neurobiology, information theory and cybernetics, this led researchers to consider the possibility of building an electronic brain.\n\nDocument (Title: History of mathematical notation): ; it is an electromechanical machine that could read two numbers, up to 8 digits long, from a card and punch their product onto the same card. In 1934, Wallace Eckert used a rigged IBM 601 Multiplying Punch to automate the integration of differential equations. In 1936, Alan Turing publishes \"On Computable Numbers, With an Application to the Entscheidungsproblem\". John von Neumann, pioneer of the digital computer and of computer science, in 1945, writes the incomplete \"First Draft of a Report on the EDVAC\".\n\nDocument (Title: Oracle machine): \", Raven Press, New York, 1965. Turing's paper is in this volume. Papers include those by Gödel, Church, Rosser, Kleene, and Post.\n- C. Papadimitriou. \"Computational Complexity\". Addison-Wesley, 1994. Section 14.3: Oracles, pp. 339–343.\n- Hartley Rogers, Jr., \"Theory of Recursive Functions and Effective Computability\", McGraw-Hill, 1967.\n- Michael Sipser. \"Introduction to the Theory of Computation\". PWS Publishing, 1997\n\nQuestion: When did the author of \"Computing Machinery and Intelligence\" die?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.14285714285714288,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "In which county does the United States Navy air base located in which  Attack Squadron 174 (VA-174) was based on?",
    "ground_truth": [
      "Duval County"
    ],
    "streamingllm_pred": "The United States Navy air base located in which Attack Squadron 174 (VA-174) was based",
    "baseline_pred": "Duval County",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Fleurieu zone): Fleurieu zone\nFleurieu zone is a wine zone located south of Adelaide in South Australia. It extends from Kangaroo Island in the west as far north as Flagstaff Hill on the west side of the Mount Lofty Ranges and to as far north as Langhorne Creek on the east side of the Mount Lofty Ranges. It consists of the following five wine regions, each of which has received appellation as an Australian Geographical Indication (AGI): Currency Creek, Kangaroo Island, Langhorne Creek, McLaren Vale and the Southern Fleurieu.\nExtent\n\nDocument (Title: Flagstaff Hill, South Australia): Flagstaff Hill, South Australia\nFlagstaff Hill is a suburb in the City of Onkaparinga local government area. It is named after the hill by that name in the area, where Colonel William Light erected a flagstaff during his survey, which was then used as a trig point. Flagstaff Hill is a leafy suburb established around the Sturt Gorge Recreation Park, maintaining many parks and reserves throughout the suburb.\nHistory.\nColonel William Light's survey teams worked south from Adelaide throughout 1838 and 1839, leaving various marks across the\n\nDocument (Title: Fleurieu zone): Fleurieu zone\nFleurieu zone is a wine zone located south of Adelaide in South Australia. It extends from Kangaroo Island in the west as far north as Flagstaff Hill on the west side of the Mount Lofty Ranges and to as far north as Langhorne Creek on the east side of the Mount Lofty Ranges. It consists of the following five wine regions, each of which has received appellation as an Australian Geographical Indication (AGI): Currency Creek, Kangaroo Island, Langhorne Creek, McLaren Vale and the Southern Fleurieu.\nExtent\n\nQuestion: Fleurieu zone extends as far north as a suburb in what South Australian city?\nAnswer: Onkaparinga\n\nDocument (Title: The Scientist (magazine)): The Scientist (magazine)\nThe Scientist is a professional magazine intended for life scientists. Coverage includes articles on recently published research papers, current research, techniques, important career news, profiles of established and up and coming scientists, publishing, research integrity and best practices, <skip>  4 July 1944\n- Tour-en-Bessin Airfield (A-13), France, 19 July 1944\n-\n\nDocument (Title: RVAH-7): a secondary role with the F-14 Tomcat equipped with the Tactical Air Reconnaissance Pod System (TARPS).\nHome station assignments.\nThe squadron was assigned to these home stations:\n- NAS Moffett Field, California\n- NAS Patuxent River, Maryland\n- NAS Whidbey Island, Washington\n- NAS Sanford, Florida\n- NAS Albany, Georgia\n- NAS Key West, Florida\nAircraft Assigned.\n- AJ-1 / AJ-2 Savage\n- A3D-2 Skywarrior\n- A3J-1 / A-5A Vigilante\n- RA-5C Vigilante\nSee\n\nDocument (Title: 168th Air Refueling Squadron): - Oujda Airfield, French Morocco, 3 March 1943\n- Rabat-Salé Airport, French Morocco, 25 April 1943\n- Sedrata Airfield, Algeria, 1 June 1943\n- Djedeida Airfield, Tunisia, 26 June 1943\n- Decimomannu Airfield, Sardinia, c. 1 November 1943\n- Serragia Airfield, Corsica, c. 21 September 1944 – 1 January 1945\n- Bradley Field, Connecticut, 25 January 1945\n- Columbia Army Air Base, South Carolina, c. 28 February–27 April 1945\n- Kadena Airfield, Okinawa\n\nDocument (Title: 174 (number)): In the military.\n- 174th Air Refueling Squadron unit of the Iowa Air National Guard\n- 174th Assault Helicopter Company\n- 174th Battalion was a unit in the Canadian Expeditionary Force during World War I\n- 174th Fighter Wing fighter support unit at Hancock Field in Syracuse, New York\n- 174th Infantry Brigade of the United States Army at Fort Drum, New York\n- AN/APQ-174 is an American K band radar in military helicopters for navigation\n- Attack Squadron 174 was a United States Navy attack squadron based\n\nQuestion: In which county does the United States Navy air base located in which  Attack Squadron 174 (VA-174) was based on?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "The Findlater Castle built on a 50 ft -high cliff overlooking the Moray Firth was redesigned in the 14th century based on the model of what Scottish castle?",
    "ground_truth": [
      "Roslyn Castle"
    ],
    "streamingllm_pred": "Tantallon Castle.  Tantallon Castle was a 14th-century castle built on a",
    "baseline_pred": "Roslyn Castle",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Melville Shavelson): including Robert Duvall and Lee Remick.\nHis autobiography, published by BearManor Media in April 2007, is \"How to Succeed in Hollywood Without Really Trying, P.S. — You Can't!\". He wrote several other books, including, with Mr. Hope, “Don’t Shoot, It’s Only Me: Bob Hope’s Comedy History of the United States” (Putnam, 1990), and \"How to Make a Jewish Movie\" (1971), a memoir of his experiences while producing and directing \"Cast\n\nDocument (Title: Jason Reitman): Jason Reitman\nJason Reitman (; born October 19, 1977) is a Canadian film director, screenwriter, and producer, best known for directing the films \"Thank You for Smoking\" (2005), \"Juno\" (2007), \"Up in the Air\" (2009), and \"Young Adult\" (2011)., he has received one Grammy Award, one Golden Globe, and four Academy Award nominations, two of which are for Best Director. Reitman is a dual citizen of Canada and the\n\nDocument (Title: Melville Shavelson): Melville Shavelson\nMelville Shavelson (April 1, 1917 – August 8, 2007) was an American film director, producer, screenwriter, and author. He was President of the Writers Guild of America, West (WGAw) from 1969 to 1971, 1979 to 1981, and 1985 to 1987.\nBiography.\nShavelson was born to a Jewish family in Brooklyn and graduated from Cornell University in 1937. worked as a writer on comedian Bob Hope's radio show, \"The Pepsodent Show Starring Bob Hope\". Shavelson\n\nQuestion: Do Melville Shavelson and Jason Reitman have different nationalities?\nAnswer: yes\n\nDocument (Title: Cucurbitaceae): Cucurbitaceae\nThe Cucurbitaceae (), also called cucurbits and the gourd family, are a plant family consisting of about 965 species in around 95 genera, the most important of which are:\n- \"Cuc <skip>  care. Externally he added extra wings to form a courtyard. Lorimer allowed himself to dabble in the Gothic, while incorporating internal details from Holyrood Palace whose restoration was the work of Sir William Bruce (1630 - 1710). Lorimer also furnished the house in every detail, using items he had commissioned\n\nDocument (Title: Scottish castles): the 1850s) as well as the National Wallace Monument at Stirling (1859–69). The rebuilding of Balmoral Castle as a baronial palace and its adoption as a royal retreat from 1855–58 confirmed the popularity of the style. Scots Baronial architects frequently \"improved\" existing castles: Floors Castle was transformed in 1838 by William Playfair who added grand turrets and cupolas. The style spread south and the architect Edward Blore added a Scots Baronial touch to his work at Windsor.\nTwentieth century to the present.\nThe Baronial style peaked towards\n\nDocument (Title: Architecture of Scotland): war of the Rough Wooing and the regency of Mary of Guise including Migliorino Ubaldini who worked at Edinburgh Castle, Camillo Marini who designed forts, and Lorenzo Pomarelli who worked for Mary of Guise during the rebuilding of forts at Inchkeith and Eyemouth. Work undertaken for James VI demonstrated continued Renaissance influences, with the Chapel Royal at Stirling having a classical entrance built in 1594 and the North Wing of Linlithgow, built in 1618, using classical pediments. Similar themes can be seen in the private houses of aristocrats, as in Mar's\n\nDocument (Title: County of Moray): county. The coat of arms, described by Thomas Innes of Learney, a future Lord Lyon, in the \"Elgin Courant\" of 6 May 1927 as \"the most beautiful county arms in Scotland\", represented the clan Murray and Randolph, Earl of Moray, the two main landowners.\nGeography.\nMoray consists of a flattish coastal section, containing the main towns, with a hilly interior, bordering onto the Grampian Mountains in the far south. Notable features of the coast are Findhorn Bay and the broad arc\n\nQuestion: The Findlater Castle built on a 50 ft -high cliff overlooking the Moray Firth was redesigned in the 14th century based on the model of what Scottish castle?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.1818181818181818,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Syracuse Orange men's basketball team was part of a conference that participated in how many total sports?",
    "ground_truth": [
      "24"
    ],
    "streamingllm_pred": "8 men's sports and 12 women's sports.",
    "baseline_pred": "24",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Thomas Nash): Thomas Nash\nThomas Nash (baptised 20 June 1593 – died 4 April 1647) was the first husband of William Shakespeare's granddaughter Elizabeth Barnard. He lived most of his life in Stratford-upon-Avon, and was the dominant male figure amongst Shakespeare's senior family line after the death of Dr. John Hall, Shakespeare's son-in-law, in 1635.\nEarly life.\nNash was baptised at the parish church of the Holy Trinity in Stratford-upon-Avon and entered in the register as\n\nDocument (Title: Elizabeth Barnard): Elizabeth Barnard\nElizabeth, Lady Barnard (formerly Nash, née Hall) (baptised 21 February 1608 – 17 February 1670) was the granddaughter of the English poet and playwright William Shakespeare. Despite two marriages, she had no children, and was his last surviving descendant.\nElizabeth was closely associated with the Royalist cause during the English Civil War. Both her husbands were dedicated supporters of Charles I.\nEarly life.\nElizabeth Hall was born to Susanna Hall and Doctor John Hall. She was baptised in the Holy\n\nDocument (Title: Thomas Nash): Thomas Nash\nThomas Nash (baptised 20 June 1593 – died 4 April 1647) was the first husband of William Shakespeare's granddaughter Elizabeth Barnard. He lived most of his life in Stratford-upon-Avon, and was the dominant male figure amongst Shakespeare's senior family line after the death of Dr. John Hall, Shakespeare's son-in-law, in 1635.\nEarly life.\nNash was baptised at the parish church of the Holy Trinity in Stratford-upon-Avon and entered in the register as\n\nQuestion: What year was the wife of Thomas Nash born?\nAnswer: 1608\n\nDocument (Title: Columbia Records): a contract with Frank Sinatra. Sinatra helped boost Columbia in revenue. Sinatra recorded over 200 songs with Columbia which include his most popular songs from his early years. Other popular artists on Columbia included Benny Goodman (signed from RCA Victor), Count Basie, Jimmie Lunceford (both signed from Decca), Eddy Duchin, Ray Noble (both moved to Columbia from Brunswick), Kate Smith, Mildred Bailey, and <skip> 2011–12 NCAA Division I men's basketball season. The head coach, Jim Boeheim, served for his 36th year. The team played its home games at the Carrier Dome in Syracuse, New York and is a member of the Big East Conference.\nIn 2015, Syracuse voluntarily vacated 9 wins from this season due to participation of ineligible players. Following an NCAA investigation, all 25 other wins were vacated.\n\nDocument (Title: 2005 Big East Men's Basketball Tournament): 2005 Big East Men's Basketball Tournament\nThe 2005 Big East Men's Basketball Championship was played from March 9 to March 12, 2005. The tournament took place at Madison Square Garden in New York City. The Syracuse Orange won the tournament and were awarded an automatic bid to the 2005 NCAA Men's Division I Basketball Tournament.\nBracket.\nNote: By finishing in last place during the regular season, St. John's did not qualify for the tournament.\nGames.\n- 1st round: Wednesday, March\n\nDocument (Title: ACC Men's Basketball Tournament): in 2014 and is now a member of the Big Ten Conference.\n- The University of South Carolina left the Atlantic Coast Conference in 1971, and it is now a member of the Southeastern Conference.\n- Since the tournament began, through the 2017 tournament, the lowest seeded team to win the championship is the sixth seed. This has happened five times: Virginia in 1976, Duke in 1980, NC State in 1987, Georgia Tech in 1993, and Maryland in 2004. Before 2005, when the league had\n\nDocument (Title: Syracuse Orange): was demolished to make way for the new on-campus facility, the Carrier Dome, which opened in 1980.\nChampionships.\nChampionships NCAA team championships.\nSyracuse University has won 15 NCAA team national championships.\n- Men's (14)\n- Basketball (1): 2003\n- Boxing (1): 1936\n- Cross Country (2): 1951, 2015\n- Lacrosse (10): 1983, 1988, 1989, 1993, 1995, 2000, 2002, 2004, 2008,\n\nQuestion: Syracuse Orange men's basketball team was part of a conference that participated in how many total sports?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "In what year was the director of the 2016 American-British biographical drama film which stars Rebecca Hall as Christine Chubbuck born?",
    "ground_truth": [
      "1983"
    ],
    "streamingllm_pred": "1983. (Note: The director of the film is Antônio Campos, who was",
    "baseline_pred": "1983",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Fendlera): Fendlera\nFendlera is a genus of shrubs in the Hydrangeaceae. They are most commonly known as fendlerbush. The name fendlerbush is also used for the closely related genus \"Fendlerella\".\n\nDocument (Title: Hippophae): Hippophae\nHippophae is a genus of sea buckthorns, deciduous shrubs in the family Elaeagnaceae. The name sea buckthorn may be hyphenated to avoid confusion with the buckthorns (\"Rhamnus\", family Rhamnaceae). It is also referred to as sandthorn, sallowthorn, or seaberry.\nTaxonomy.\nIn ancient times, leaves and young branches from sea buckthorn were supposedly fed as a remedy to horses to support weight gain and appearance of the coat, thus leading to the name of the genus, \"Hippophae\" derived from \"\n\nDocument (Title: Hippophae): Hippophae\nHippophae is a genus of sea buckthorns, deciduous shrubs in the family Elaeagnaceae. The name sea buckthorn may be hyphenated to avoid confusion with the buckthorns (\"Rhamnus\", family Rhamnaceae). It is also referred to as sandthorn, sallowthorn, or seaberry.\nTaxonomy.\nIn ancient times, leaves and young branches from sea buckthorn were supposedly fed as a remedy to horses to support weight gain and appearance of the coat, thus leading to the name of the genus, \"Hippophae\" derived from \"\n\nQuestion: Are Hippophae and Fendlera both a genus of shrubs?\nAnswer: yes\n\nDocument (Title: KMRB): KMRB\nKMRB (1430 AM) is a radio station in Pasadena, California, United States (licensed to and transmitted from San Gabriel, California) that broadcasts completely in Cantonese 24 hours a day. It is the sister station to KAZN, which broadcasts in Mandarin. It is owned and operated by Multicultural Radio Broadcasting, Inc..\nExternal links.\n- Official website in Chinese\n- Official website (translated to English with Google <skip>  Danish Girl\"\n- Nick Hornby (Best Adapted Screenplay) – \"Brooklyn\"\n- Oliver Tarney (Best Sound Editing) – \"The Martian\"\n- Paul Massey (Best Sound Mixing) – \"The Martian\"\n- Richard Williams (Best Animated Short Film) – \"Prologue\"\n-\n\nDocument (Title: Sebastian Koch): Koch) is a key figure in the process. The movie premiered at the New York Film Festival and was nominated for the 2016 Academy Award for Best Picture.\nThe biographical romantic drama film \"The Danish Girl\" by Academy Award winner Tom Hooper (\"The King’s Speech\") is about one of the first known recipients of sex reassignment surgery. Koch portrays Kurt Warnekros, a doctor at the Dresden Municipal Women’s Clinic, who was one of the first to carry out such operations. The cast furthermore includes\n\nDocument (Title: Chicago International Film Festival): – Jörg Gudzuhn (GDR) for \"\"\n- 1987 – Avtandil Makharadze (Georgia) for \"Monanieba\"\n- 1971 – Ezzatollah Entezami (Iran) for \"The Cow\"\nSilver Hugo Best Actress.\n- 2018 - Zhao Tao (China) for \"Ash Is Purest White\"\n- 2017 - Jowita Budnik (Poland) and Eliane Umuhire (Rwanda) for \"Birds Are Singing in Kigali\"\n- 2016 – Rebecca Hall (UK) for \"Christine\"\n- 2015 – Lizzie Brocheré (\n\nDocument (Title: List of film director and editor collaborations): 2012).\n- Robert Altman: Geraldine Peroni (1990–2003), \"The Player\" (1992).\n- Woody Allen: Ralph Rosenblum (1969–78), \"Annie Hall\" (1977).\n- Paul Thomas Anderson: Dylan Tichenor (1997–2007, 2017-present), \"There Will Be Blood\" (2007).\n- Darren Aronofsky: Andrew Weisblum (2008–present), \"Black Swan\" (2010).\n- Hal Ashby: Robert C. Jones (1973–1982). \"Bound for Glory\n\nQuestion: In what year was the director of the 2016 American-British biographical drama film which stars Rebecca Hall as Christine Chubbuck born?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.18181818181818182,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Which of the office buildings used to staff the White House used to be known as the State, War, and Navy Building?",
    "ground_truth": [
      "Eisenhower Executive Office Building"
    ],
    "streamingllm_pred": "The Old Executive Office Building.  The Old Executive Office Building, formerly known as the State, War",
    "baseline_pred": "Eisenhower Executive Office Building",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: The Long Walk Home): The Long Walk Home\nThe Long Walk Home is a 1990 American historical drama film starring Sissy Spacek and Whoopi Goldberg, and directed by Richard Pearce.\nSet in Alabama, it is based on a screenplay about the Montgomery Bus Boycott (1955–1956) by John Cork and a short film by the same name, produced by students at the University of Southern California in 1988.\nOrigins.\nThe feature film is based on a short screenplay and film of the same name, written by John Cork, then a graduate\n\nDocument (Title: The Long Walk Home): The Long Walk Home\nThe Long Walk Home is a 1990 American historical drama film starring Sissy Spacek and Whoopi Goldberg, and directed by Richard Pearce.\nSet in Alabama, it is based on a screenplay about the Montgomery Bus Boycott (1955–1956) by John Cork and a short film by the same name, produced by students at the University of Southern California in 1988.\nOrigins.\nThe feature film is based on a short screenplay and film of the same name, written by John Cork, then a graduate\n\nDocument (Title: Whoopi Goldberg): Whoopi Goldberg\nCaryn Elaine Johnson (born November 13, 1955), known professionally as Whoopi Goldberg (), is an American actress, comedian, author, and television personality. She has been nominated for 13 Emmy Awards and is one of the few entertainers to have won an Emmy Award, a Grammy Award, an Academy Award, a Tony Award (EGOT). She is the second black woman to win an Academy Award for acting.\nGoldberg's breakthrough came in 1985 for her role as Celie, a\n\nQuestion: The Long Walk Home is a 1990 American historical drama film starring Sissy Spacek and, which American actress, comedian, author, and television host, born November 13, 1955, known professionally as who?\nAnswer: Whoopi Goldberg\n\nDocument (Title: Kavana (album)): Kavana (album)\nKavana is the debut studio album by British singer-songwriter Kavana. Kavana was discovered by Take That's manager Nigel Martin-Smith, and was subsequently signed to his label in early 1996. The album was recorded <skip>  assignment to the National Security Council staff at the White House where she reported for duty in August 1995.\nIn July 1997, Vice Adm. Brown assumed command of the Naval Computer and Telecommunications Area Master Station Atlantic headquartered in Norfolk, Virginia. Completing her command tour in June 1999, Vice Adm. Brown returned to the White House as the Deputy Director, White House Military Office. It was during this tour Vice Adm. Brown was selected\n\nDocument (Title: Randy Levine): 2008.\nIn December 2018, Levine's name was leaked as a potential replacement for departing White House Chief of Staff John F. Kelly. Levine has dismissed these rumors, saying he is content with the Yankees.\nPersonal.\nLevine resides in Manhattan and also on his farm in Pawling, New York with his wife Mindy Franklin and their six dogs Zion, Otto, Zbiggy Pierogi, Miss Lucy, Jemimah and Pearl V. He also has five horses, including two quarterhorses, Hanukah Harry and Olaf, the former runaway\n\nDocument (Title: John S. Pustay): was the assistant dean of the faculty.\nIn September 1966, Pustay was appointed a White House fellow and served as executive assistant to the secretary of state, with duty at the White House and Department of State. Upon completion of the fellowship, he was assigned to Headquarters U.S. Air Force, Washington, D.C., as a long-range plans officer in the Office of the Deputy Chief of Staff, Plans and Operations. From 1965 to 1969, Pustay completed several temporary duty assignments in Southeast Asia. While there he\n\nDocument (Title: Main Navy and Munitions Buildings): the White House. By the 1930s, the War Department was being squeezed out by the Department of State, and the White House was also in need of additional office space. In August 1939, Secretary of War Harry H. Woodring, along with Acting Chief of Staff of the Army George C. Marshall, moved his office into the Munitions Building. In the late 1930s, a new War Department Building was constructed at 21st and C Streets in Foggy Bottom, but upon completion, the new building did not solve the department's\n\nQuestion: Which of the office buildings used to staff the White House used to be known as the State, War, and Navy Building?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.3529411764705882,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Grafton and Carroll counties as well as the Pratt Family Camps border what lake in New Hampshire?",
    "ground_truth": [
      "Squam Lake"
    ],
    "streamingllm_pred": "Squam Lake.  Grafton and Carroll counties as well as the Pratt Family Camps border",
    "baseline_pred": "Squam Lake",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: The Flying Machine (film)): The Flying Machine (film)\nThe Flying Machine is a 2011 3-D live action/animated film produced by BreakThru Films. The film is directed by Martin Clapp and Geoff Lindsey, and stars Heather Graham and Lang Lang.\nPlot.\nA family takes a journey across the globe on a strange and amazing flying machine, experiencing a series of adventures along the way.\nCast.\n- Heather Graham as Georgie, a single mother who struggles to balance her work and family life.\n- Lang Lang as\n\nDocument (Title: Heather Graham): Heather Graham\nHeather Joan Graham (born January 29, 1970) is an American actress. After appearing in television commercials, her first starring role in a feature film came with the teen comedy \"License to Drive\" (1988), followed by the critically acclaimed film \"Drugstore Cowboy\" (1989), which gained her initial industry notice. She then played supporting roles in films such as \"Shout\" (1991), \"Diggstown \"(1992), \"Six Degrees of Separation\" (1993),\n\nDocument (Title: The Flying Machine (film)): The Flying Machine (film)\nThe Flying Machine is a 2011 3-D live action/animated film produced by BreakThru Films. The film is directed by Martin Clapp and Geoff Lindsey, and stars Heather Graham and Lang Lang.\nPlot.\nA family takes a journey across the globe on a strange and amazing flying machine, experiencing a series of adventures along the way.\nCast.\n- Heather Graham as Georgie, a single mother who struggles to balance her work and family life.\n- Lang Lang as\n\nQuestion: Which actress appeared in both The Flying Machine and \"License to Drive?\"\nAnswer: Heather Graham\n\nDocument (Title: Evison Matafale): Evison Matafale\nEvison Matafale (20 November 1969 - 27 November 2001) was a Malawian Rastafarian whose music rose to popularity in Malawi. He was the founder and leader of the reggae band Black Missionaries. Matafale rose to fame and became one of Malawi's favourite musicians by 2000 through the release of his debut album, \"Kuimba 1\", in 199 <skip> 1921, the family-run camp operated until 1942, when it closed due to logistical difficulties associated with World War II. The camp property is listed on the National Register of Historic Places.\nHistory.\nThe camp property was purchased in 1921 by Mary P. and Henry Dike Sleeper, and Hugh and Helen Worthington. The Sleepers, residents of Northampton, Massachusetts, had previously served as counselors at the Aloha\n\nDocument (Title: Ossipee, New Hampshire): Ossipee, New Hampshire\nOssipee is a town in Carroll County, New Hampshire, United States. The population was 4,345 at the 2010 census. It is the county seat of Carroll County. Ossipee, which includes several villages, is a resort area and home to part of Pine River State Forest.\nHistory.\nOriginally known as Wigwam Village, and then New Garden, the town was named for the Ossipee Indians, one of the twelve Algonquian tribes. It was once the site of an Indian stockade fort,\n\nDocument (Title: Sunapee, New Hampshire): Sunapee, New Hampshire\nSunapee is a town in Sullivan County, New Hampshire, United States. The population was 3,365 at the 2010 census. Sunapee is home to part of Lake Sunapee. The town includes the village of Georges Mills.\nHistory.\nLike many other towns, this one went through name changes before its incorporation in 1781: \"Saville\" in 1768, \"Corey's Town\", and then \"Wendell\", for one of the Masonian Proprietors, John Wendell. The marsh near Sunapee Middle\n\nDocument (Title: Camp Lincoln (New Hampshire)): as an all-boys camp that offered one-week overnight sessions throughout the summer. Today, camp is offered to both boys and girls who enjoy spending their summer days outside in the water and on the shores of Kingston Lake.\" \nThe camp was founded in 1926 when Warren Tucker sold land to the local area YMCA. The site was dedicated to the boyhood of President Abraham Lincoln.\nIn 2017, Camp Lincoln raised just over $32,000 for the construction of a handicap-accessible tree house to be built\n\nQuestion: Grafton and Carroll counties as well as the Pratt Family Camps border what lake in New Hampshire?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.2666666666666667,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Which of these is further south in China, the Pulandian District or Kaiyuan, Liaoning?",
    "ground_truth": [
      "Pulandian District"
    ],
    "streamingllm_pred": "Kaiyuan, Liaoning is further south in China. Pulandian District is located in the",
    "baseline_pred": "Pulandian District",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Northern Inuit Dog): Northern Inuit Dog\nThe Northern Inuit Dog is a crossbred dog that originated in the late 1980s, in an attempt to create a domestic dog breed more closely resembling the wolf. It is currently only recognized by its own independent breed club, but by no other major kennel clubs. The dog originates from crosses among German Shepherd Dogs, Siberian Huskies, Samoyeds, Alaskan Malamute  and a variety of Inuit breeds. Although the original stock is Canadian in origin, the breed was developed in the UK. Embark in the USA\n\nDocument (Title: American Hairless Terrier): American Hairless Terrier\nThe American Hairless Terrier is a rare breed of dog that was derived as a variant of Rat Terrier. As of January 1, 2004, the United Kennel Club deemed the AHT a separate terrier breed, granting it full UKC recognition. An intelligent, social and energetic working breed, the American Hairless Terrier is often listed as a potential good breed choice for allergy sufferers.\nHistory.\nThe American Hairless Terrier's American ancestry begins with the mixed breed terriers called Feists brought from Europe to North America\n\nDocument (Title: American Hairless Terrier): American Hairless Terrier\nThe American Hairless Terrier is a rare breed of dog that was derived as a variant of Rat Terrier. As of January 1, 2004, the United Kennel Club deemed the AHT a separate terrier breed, granting it full UKC recognition. An intelligent, social and energetic working breed, the American Hairless Terrier is often listed as a potential good breed choice for allergy sufferers.\nHistory.\nThe American Hairless Terrier's American ancestry begins with the mixed breed terriers called Feists brought from Europe to North America\n\nQuestion: American Hairless Terrier and Northern Inuit Dog are both different specials of the same animal?\nAnswer: yes\n\nDocument (Title: Dimitri Lauwers): Dimitri Lauwers\nDimitri Lauwers (born April 30, 1979) is a Belgian professional basketball. He also played for the Belgian national basketball team at EuroBasket 2011.\nProfessional career.\nIn the 1997 he made his debut with the <skip>  Xianwei Subdistrict (), Linjiang Subdistrict (), Huayuan Subdistrict (), Zhanqian Subdistrict (), Maokuishan Subdistrict (), Xicheng Subdistrict ()\nThe only town is Tangchi ()\nEducation\n\nDocument (Title: Liang Bin): city of Lüliang. He began his political career in August 1974, and joined the Communist Party of China in June 1979. During the Cultural Revolution, he became a sent-down youth worked in his home province.\nHe entered Taiyuan University of Technology in December 1976, majoring in electrical machinery, where he graduated in August 1979.\nHe spent 13 years working at his alma mater before serving in various political roles in Shanxi province.\nIn December 1992 he became the Deputy Secretary of Communist Youth League of Shanxi\n\nDocument (Title: District (Taiwan)): residents of these districts. Also, the directors of these districts and administrative centers are appointed by the mayors, with four years per term.\nOn 4 February 2014, six districts were reclassified as Special Municipal Mountain Indigenous District (; or shortened as Mountain Indigenous District ()): Wulai in New Taipei, Fuxing in Taoyuan, Heping in Taichung, along with Namasia, Maolin, and Taoyuan in Kaohsiung.\nDistricts in Taiwan.\nDistricts in Taiwan Districts by cities.\nIn Taiwan, districts are the only subdivisions of\n\nDocument (Title: List of township-level divisions of Liaoning): 九道街道), Guangji Subdistrict (广济街道), Xingdong Subdistrict (兴东街道)\nThe only town is Jinshan (金山镇)\nDandong Zhen'an District.\nSubdistricts:\n- Yalu River Subdistrict (鸭绿江街道), Zhenzhu Subdistrict (珍珠街道), Taiping Bay Subdistrict (太平湾街道), Jinkuang Subdistrict (金矿街道)\nTowns:\n- Wulongbei (五龙背镇), Loufang (楼房镇), Tangshancheng (汤山城镇), Tongxing (同兴镇), Jiuliancheng (九连城镇)\nDandong Zhenxing District.\nSubdistricts:\n- Yongchang Subdistrict (永昌街道)\n\nQuestion: Which of these is further south in China, the Pulandian District or Kaiyuan, Liaoning?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.2857142857142857,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Both Olaf Eller and Lars Eller are involved in which sport?",
    "ground_truth": [
      "ice hockey"
    ],
    "streamingllm_pred": "Ice hockey.  Olaf Eller is a Danish ice hockey player, and Lars Eller is",
    "baseline_pred": "ice hockey",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Wayman Tisdale): Wayman Tisdale\nWayman Lawrence Tisdale (June 9, 1964 – May 15, 2009) was an American professional basketball player in the National Basketball Association (NBA) and a smooth jazz bass guitarist. A three-time All American at the University of Oklahoma, he was elected to the National Collegiate Basketball Hall of Fame in 2009.\nEarly life.\nTisdale was born in Fort Worth, Texas. His father, Louis Tisdale, was a well-known pastor in Tulsa, Oklahoma, serving for 21 years as\n\nDocument (Title: Rendezvous Music): his first Grammy Award for song \"It's What I Do\" (feat. Lalah Hathaway) from album \"The Gospel According to Jazz Chapter III\" released on Rendezvous Music in 2010. Since its acquisition in August 2008, Rendezvous is part of the Mack Avenue Records label group and continues to release new music by Kirk Whalum, Jonathan Butler, Kyle Eastwood as well as previously unreleased music by Wayman Tisdale.\nList of Rendezvous Artists.\n- Adani & Wolf\n- Brian Simpson\n- Camiel\n- Jonathan\n\nDocument (Title: Rendezvous Music): his first Grammy Award for song \"It's What I Do\" (feat. Lalah Hathaway) from album \"The Gospel According to Jazz Chapter III\" released on Rendezvous Music in 2010. Since its acquisition in August 2008, Rendezvous is part of the Mack Avenue Records label group and continues to release new music by Kirk Whalum, Jonathan Butler, Kyle Eastwood as well as previously unreleased music by Wayman Tisdale.\nList of Rendezvous Artists.\n- Adani & Wolf\n- Brian Simpson\n- Camiel\n- Jonathan\n\nQuestion: What kind of instrument was played by the artist who's music was finally released by Rendezvous music post 2008?\nAnswer: bass guitar\n\nDocument (Title: Matthew Tuck): Matthew Tuck\nMatthew \"Matt\" Tuck (born 20 January 1980) is a Welsh musician. He is the lead vocalist and rhythm guitarist in the Welsh metalcore band Bullet for My Valentine. He and <skip>  Premier League in 1988–89, and last played in the league in 1993–94, when they ended in last place.\nOther sports.\nWell-known skiers include Alf Andersen. Ice hockey player Frank Olafsen, while Skeid still offered that sport, participated in the 1964 Winter Olympics.\n\nDocument (Title: Ole Ellefsæter): Ole Ellefsæter\nOle Martin Ellefsæter (born 15 February 1939) is a retired athlete from Norway. He mostly competed in cross-country skiing, and won two gold medals at the 1968 Winter Olympics. At the 1966 FIS Nordic World Ski Championships he won one gold (4×10 km) and one silver (15 km) medal, and in 1971 he became the first Norwegian to win Vasaloppet. Anders Aukland and Jørgen Aukland are the only other Norwegians to win this ski race. Earlier in 1967, Ellefsæter won\n\nDocument (Title: Eller College of Management): nationally recognized entrepreneur, was inducted into the Advertising Hall of Fame by the American Advertising Federation in March 2004 in New York City. Eller is also the namesake of the Eller College of Management.\n- Jim Furyk – professional golfer\n- Terry Lundgren – CEO/Chairman of the Board/President/Director at Federated Department Stores, Inc., the parent company of Macy's and Bloomingdale's department stores\n- Arturo Moreno – Owner of the Los Angeles Angels of Anaheim Major League Baseball team, outdoor advertising entrepreneur\n-\n\nDocument (Title: Hillar Eller): Hillar Eller\nHillar Eller (15 December 1939, Kärdla – 22 February 2010) was an Estonian former long distance runner and politician, most notable for being a voter for the Estonian restoration of Independence. He was also the former chair of the Estonian Left Party from 1995 to 1996.\nEller graduated from Kärdla Secondary School in 1958, from the Law Faculty at the University of Tartu in 1973, and in 1981 from Leningrad Communist University.\nHe worked in the Sports Federation of Power in Hiiumaa from 1958 to 1964\n\nQuestion: Both Olaf Eller and Lars Eller are involved in which sport?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.2666666666666667,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Henry Roth and Lewis Mumford are both this nationality?",
    "ground_truth": [
      "American"
    ],
    "streamingllm_pred": "American.  (Note: Both Henry Roth and Lewis Mumford were born in the United States of",
    "baseline_pred": "American",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Lamar Odom): Lamar Odom\nLamar Joseph Odom (born November 6, 1979) is an American professional basketball player. As a member of the Los Angeles Lakers in the National Basketball Association (NBA), he won NBA championships in 2009 and 2010 and was named the NBA Sixth Man of the Year in 2011.\nAs a high school player, Odom received national player of the year honors from \"Parade\" in 1997. He played college basketball for the University of Rhode Island, earning all-conference honors in his only season\n\nDocument (Title: Shamel Jones): Shamel Jones\nShamel Jones is a former collegiate basketball player and streetball player. Jones skipped over St John's University, UNLV, and TCU to play for Georgetown. Jones originally played for the 1996–97 Georgetown Hoyas men's basketball team and later the University of Memphis. He took Memphis to the NIT championships during his time there. The 6'9 forward originally played for Paul Robeson HS along with Lamar Odom. He was considered to be a city Basketball legend. He played basketball in Brazil for Winner/Kabum Limeira. He teamed\n\nDocument (Title: Shamel Jones): Shamel Jones\nShamel Jones is a former collegiate basketball player and streetball player. Jones skipped over St John's University, UNLV, and TCU to play for Georgetown. Jones originally played for the 1996–97 Georgetown Hoyas men's basketball team and later the University of Memphis. He took Memphis to the NIT championships during his time there. The 6'9 forward originally played for Paul Robeson HS along with Lamar Odom. He was considered to be a city Basketball legend. He played basketball in Brazil for Winner/Kabum Limeira. He teamed\n\nQuestion: when was the  American retired professional basketball player. which Shamel Jones played along side with born \nAnswer: November 6, 1979\n\nDocument (Title: Jubaea): Jubaea\nJubaea is a genus of palms with one species, Jubaea chilensis or \"Jubaea spectabilis\", commonly known as the \"Chilean wine palm\" or \"Chile cocopalm\". It is native to southwestern South <skip>  15, 2012) was an American novelist and playwright.\nEarly years.\nDenker was born in New York, the son of a fur trader. After initially studying to be a rabbi, he change to the study of law and graduated from New York Law School in 1934. He stopped practicing law but used his legal background for numerous written works.\nCareer.\nDenker was admitted to the New York Bar in 1935, at the height of\n\nDocument (Title: Henry H. Neff): - Fantastic Fiction Author Page\n\nDocument (Title: Henry Fowler (hymn writer)): Henry Fowler (hymn writer)\nHenry Fowler (11 December 1779 – 1838), was an English hymn-writer.\nFowler was born at Yealmpton, Devonshire. In early life he followed some trade, but occasionally preached in independent meeting-houses in Devonshire and at Bristol. At length, in October 1813, he ‘received a call’ to Birmingham, where he continued until the end of 1819.\nUltimately he settled in London, becoming in July 1820 minister of Gower Street Chapel. He died 16\n\nDocument (Title: Henry Reed (poet)): Henry Reed (poet)\nHenry Reed (22 February 1914 – 8 December 1986) was a British poet, translator, radio dramatist, and journalist.\nLife and work.\nReed was born in Birmingham and educated at King Edward VI School, Aston, followed by the University of Birmingham. At university he associated with W. H. Auden, Louis MacNeice and Walter Allen. He went on to study for an MA and then worked as a teacher and journalist. He was called up to the Army in 1941,\n\nDocument (Title: Harry Fowler): Harry Fowler\nHenry James \"Harry\" Fowler, MBE (10 December 1926 – 4 January 2012) was an English actor in film and television. Over a career lasting more than sixty years, he made nearly 200 appearances on screen.\nPersonal life.\nFowler was born in Lambeth, South London on 10 December 1926. As a \"near illiterate newspaper boy\" making eight shillings a week, he told film historian Brian McFarlane, he was invited on to radio to speak about his life in wartime London.\n\nQuestion: Henry Roth and Lewis Mumford are both this nationality?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.13333333333333333,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Which actor in the film Equus is also in the film The Informers?",
    "ground_truth": [
      "Colin Blakely"
    ],
    "streamingllm_pred": "Colin Blakely. He played the role of a stable manager in Equus and appeared in the",
    "baseline_pred": "Colin Blakely",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: My Morning Jacket): My Morning Jacket\nMy Morning Jacket is an American rock band formed in Louisville, Kentucky in 1998. The band currently consists of vocalist/guitarist Jim James, bassist Tom Blankenship, drummer Patrick Hallahan, guitarist Carl Broemel, and keyboardist Bo Koster. The band's sound, rooted in rock and country, is often experimental and psychedelic. The group amassed a following beginning in the 2000s in part due to their live performances.\nThe group first found success in Europe after the release of its debut album, \"The\n\nDocument (Title: Pulp (band)):. Singer/songwriter Scott Walker agreed to produce the record and this symbolised a new phase in Pulp's development. This new effort fell short of expectations and was to be Pulp's last.\nPulp subsequently undertook a tour of the National Parks in the UK, even playing a show as far north as Elgin in Scotland. Richard Hawley, the Sheffield-based singer/songwriter, was also present on various dates on this tour. He later described it as \"very much pink feather boas and glamour which was great\n\nDocument (Title: Pulp (band)): Pulp (band)\nPulp were an English rock band formed in Sheffield in 1978. Their best-known line-up from their heyday (1992–1997) consisted of Jarvis Cocker (vocals, guitar, keyboards), Candida Doyle (keyboards), Russell Senior (guitar, violin), Mark Webber (guitar, keyboards), Steve Mackey (bass) and Nick Banks (drums, percussion).\nThroughout the 1980s, the band struggled to find success, but gained prominence in the UK in the mid-1990s with\n\nQuestion: Pulp and My Morning Jacket both having their sound rooted in which genre?\nAnswer: rock\n\nDocument (Title: Sip 'n Dip Lounge): Sip 'n Dip Lounge\nThe Sip 'n Dip Lounge is a tiki bar in Great Falls, Montana opened in 1962, when Polynesian themes were popular, and it has survived to the present day with its tiki theme intact. Located inside a local motel that was considered modern and trendy at the time it was built, <skip> . He is most noted for his performance in the film \"Indian Horse\", for which he was nominated for Best Supporting Actor at the 6th Canadian Screen Awards in 2018.\nPeltier currently resides in Ottawa, Ontario and is from Wiikwemkoong Unceded Reserve located on Manitoulin Island in Ontario. He was cast in the film, his first ever acting role, after responding to a casting announcement looking for First Nations children who could skate.\n\nDocument (Title: John Wyman): \", \"Blake's 7\", \"The Fourth Arm\" and \"Tales of the Unexpected\".\nIn 1977, his film career started with Richard Burton and Joan Plowright, in Sidney Lumet's \"Equus\". The following year he starred in \"Revenge of the Pink Panther\" and \"Adventures of a Plumber's Mate\", and appeared in the fantasy film \"Arabian Adventure\" in 1979. His big break came in 1981 when he appeared in \"For Your Eyes Only\" as Erich Kriegler,\n\nDocument (Title: The Informers (1963 film)): The Informers (1963 film)\nThe Informers (US title - Underworld Informers) is a 1963 British crime film produced and distributed in the UK by The Rank Organisation and distributed in the USA by Continental Film Distributors. It was directed by Ken Annakin and produced by William MacQuitty, with the screenplay by Paul Durst and Alun Falconer from the novel \"Death of a Snout\" by Douglas Warner. It stars Nigel Patrick, Margaret Whiting, Harry Andrews, Derren Nesbitt and Colin Blakely. Cinematography was by Reginald H. Wyer.\n\nDocument (Title: The Dark Horse (2014 film)): and Mutt begins beating Genesis, but is stopped by Ariki. Genesis removes Mana's jacket, and they walk out together, being followed and verbally abused by Mutt. Other members of the Gang begin beating Mutt, and Genesis and Mana leave. The closing montage reveals that the Eastern Knights chess club is still being run, and that Genesis passed away in 2011. \nCast.\n- Cliff Curtis as Genesis\n- James Rolleston as Mana\n- Wayne Hapi as Ariki\n- Kirk Torrance as Noble\n- Miriama\n\nQuestion: Which actor in the film Equus is also in the film The Informers?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.2666666666666667,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "The Column of Saint Zanobi  is a monumental marble column located just north of religious building with the status of what?",
    "ground_truth": [
      "a minor basilica"
    ],
    "streamingllm_pred": "Baptistery. The Column of Saint Zanobi is a monumental marble column located just north of the",
    "baseline_pred": "minor basilica",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: The Sweet Sex and Love): The Sweet Sex and Love\nThe Sweet Sex and Love is a 2003 South Korean erotic romance film. It was directed by Bong Man-dae and starred Kim Seo-hyung and Kim Sung-soo. The entire score was based on a digitally remastered recording of the works of Bedřich Smetana.\nCast.\n- Kim Seo-hyung\n- Kim Sung-soo\n\nDocument (Title: Bong Man-dae): Bong Man-dae\nBong Man-dae, is a South-Korean Actor, Assistant director, Director and Scriptwriter. He is known as a soft-core porn director.\nBiography.\nBorn in Gwangju, South Korea.\nBefore making his mainstream feature film debut in 2003, BONG directed 15 straight-to-video films which were acknowledged for their strong narratives and stylish visuals. He also directed the TV series which was broadcast in 2004.\nFilmography (Director).\n- Trap (2015\n\nDocument (Title: Kim Sung-soo (actor)): Kim Sung-soo (actor)\nKim Sung-soo (born May 23, 1973) is a South Korean actor and television host. After beginning his career as a fashion model, Kim made his acting debut in the tokusatsu series \"Vectorman\" and the erotic film \"The Sweet Sex and Love\". He has since appeared in the movies \"The Red Shoes\" and \"\", and several television series, including \"Full House\", \"My Precious You\", \"More Charming by the Day\n\nQuestion: What actor born in 1973 starred in a 2003 South Korean film directed by Bong Man-dae?\nAnswer: Kim Sung-soo\n\nDocument (Title: Williams County, Ohio): Williams County, Ohio\nWilliams County is a county located in the U.S. state of Ohio. As of the 2010 census, the population was 37,642. Its county seat is Bryan. The county was created in 1820 and later organized in 1824. It is named for David Williams, one of the captors of John André in the American Revolutionary War.\nGeography.\nAccording to the U.S. Census Bureau, the county has a total area of, of which is land and (0. <skip>  Strozzi):. \nIn 1438, he married Nanna Francesco Strozzi and moved into a new house in the same parish in Fiesole. Before that he was sharing a house with Sanguigni, with whom he may have collaborated. When Fra Angelico moved to Rome in 1446, Strozzi moved to a rented house in Florence, in the parish of San Paolo, near Santa Maria Novella. In 1450 he bought a house in another parish. He is buried in Santa Maria Novella, Florence.\nWorks.\nWorks Panel paintings.\nHis only\n\nDocument (Title: San Benedetto, Florence): San Benedetto, Florence\nSan Benedetto is a small, Roman Catholic former parish church, then oratory, located in a piazza of the same name just off the piazza of the Duomo of Florence, region of Tuscany, Italy.\nHistory.\nThe church was founded around the year 1000, but transferred from parish to a confraternity. It was suppressed in 1771, and still retains a chapel with an altarpiece depicting the \"Miracle of San Zanobi\", attributed to Bernardo Veracini.\n\nDocument (Title: Christ at the Column (Gregorio Fernández)): \n\nDocument (Title: Velehrad): stone called the \"King's table\" (\"Králův stůl\")\n- A statue of St. John of Nepomuk\n- A column with the statue of Jesus Christ\n- A column with the statue of Virgin Mary\n- A column with the statue of St. John of Nepomuk\n- A Cistercian monastery\n\nDocument (Title: Plague Column, Košice): Plague Column, Košice\nThe Plague Column () or Immaculata is a Baroque plague column (Marian and Holy Trinity column) in Košice, Slovakia. \nThe column is situated in a small park and commemorates the gratitude to Mary for an end to the plague epidemic from 1709 and 1710. It was erected at the place of medieval gallows at Fő utca (\"Main Street\", now called Hlavná ulica) in 1723. Local legend holds that the relics of Saint Valentine are hidden beneath the structure.\nIt is\n\nQuestion: The Column of Saint Zanobi  is a monumental marble column located just north of religious building with the status of what?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Which show which aired on NBC from September 22, 1994, to May 6, 2004, has the fifteenth episode entitled, \"The One with the Girl Who Hits Joey\"?",
    "ground_truth": [
      "Friends"
    ],
    "streamingllm_pred": "Friends.  The episode is from Season 7.  The episode is about Joey dating a girl",
    "baseline_pred": "Friends",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Larry Buttrose): Larry Buttrose\nLarry Philip Buttrose (born 16 December 1952) is an Australian writer, journalist and academic. He is the ghostwriter of the Saroo Brierley memoir \"A Long Way Home\" (adapted for the screen as the major international feature film \"Lion\"). He is also the author of the novels \"The Maze of the Muse\" and \"Sweet Sentence\", and the travel books \"The King Neptune Day & Night Club\", and \"Cafe Royale\" (also published as \"The Blue Man\n\nDocument (Title: Saroo Brierley): Saroo Brierley\nSaroo Brierley (born 1982) is an Indian-born Australian businessman and author who, at age five, was accidentally separated from his biological mother. He was adopted by an Australian couple and, 25 years later, reunited with his biological mother after finding his hometown via Google Earth. His story generated significant international media attention, especially in Australia and India.\nAn autobiographical account of his experiences, \"A Long Way Home\", was published in 2013 in Australia, released internationally in 2014, and\n\nDocument (Title: Larry Buttrose): Larry Buttrose\nLarry Philip Buttrose (born 16 December 1952) is an Australian writer, journalist and academic. He is the ghostwriter of the Saroo Brierley memoir \"A Long Way Home\" (adapted for the screen as the major international feature film \"Lion\"). He is also the author of the novels \"The Maze of the Muse\" and \"Sweet Sentence\", and the travel books \"The King Neptune Day & Night Club\", and \"Cafe Royale\" (also published as \"The Blue Man\n\nQuestion: Larry Philip Buttrose (born 16 December 1952) is an Australian writer, journalist and academic, he is the ghostwriter of which Indian-born Australian businessman who, at age five, was accidentally separated from his biological mother?\nAnswer: Saroo Brierley\n\nDocument (Title: Sky and Sand): Sky and Sand\n\"Sky and Sand\" is a song by German electronic music producers Paul Kalkbrenner and Fritz Kalkbrenner. The song was originally produced as the title song of the German movie \"Berlin Calling\" written and <skip> , after \"SVU\" and \"CPD\" briefly crossed-over with \"SVU\"s fifteenth season's episode, \"Comic Perversion\" which guest starred Sophia Bush, who portrayed her \"CPD\" character, Detective Erin Lindsay; while Ice-T & Kelli Giddish briefly portrayed their characters respectively in the episode \"Conventions\" of \"Chicago PD\", two episodes which Leight and Olmstead wouldn't call a true 'crossover'.\nOn\n\nDocument (Title: List of ER characters):'s Estelle Harris in \"Bloodline,\" but she also appeared in a long shot in \"Don't Ask, Don't Tell,\" berating him for using her trashcans to trap a kangaroo on the loose. The episode was also one of the last episodes to show Jerry smoking a cigar.\nIn the Season 15 episode \"The High Holiday\", Jerry returns to Chicago as he got tired of Alaska, and was first amicably welcomed back by Frank and Morris. Although he has not had any luck getting a\n\nDocument (Title: Operation: Broken Feather): Operation: Broken Feather\n\"Operation: Broken Feather\" is the fifteenth episode of the first season of the American television police sitcom series \"Brooklyn Nine-Nine\". It is the 15th overall episode of the series and is written by series creators Dan Goor & Michael Schur and directed by Julie Anne Robinson. It aired on Fox in the United States on February 2, 2014. The episode was selected by Fox to be broadcast, along with \"New Girl\", after Super Bowl XLVIII. The episode was the\n\nDocument (Title: Sweet 15): Sweet 15\nSweet 15 is a 1990 American made-for-television family drama film directed by Victoria Hochberg and starring Karla Montana, Panchito Gómez, Jerry Stiller, and Tony Plana. The plot concerns a fourteen-year-old girl whose dreams of having a perfect quinceanera are suddenly halted when she realizes that her family is residing in the United States illegally. At the same time, she is smitten by Ramon, a cousin of her friend, and wants him to dance with her at her party. \nA\n\nQuestion: Which show which aired on NBC from September 22, 1994, to May 6, 2004, has the fifteenth episode entitled, \"The One with the Girl Who Hits Joey\"?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.15384615384615385,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "What is the nationality of the man who finished third in the 2016 Pau Grand Prix?",
    "ground_truth": [
      "British"
    ],
    "streamingllm_pred": "French (Romain Grosjean) and British (Lewis Hamilton) and French (Romain Gros",
    "baseline_pred": "British",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Columbia Records): Columbia Records\nColumbia Records is an American record label owned by Sony Music Entertainment, a subsidiary of Sony Corporation of America, the North American division of Japanese conglomerate Sony. It was founded in 1887, evolving from the American Graphophone Company, the successor to the Volta Graphophone Company. Columbia is the oldest surviving brand name in the recorded sound business, and the second major company to produce records. From 1961 to 1990, Columbia recordings were released outside North America under the name CBS Records to avoid confusion with EMI's Columbia\n\nDocument (Title: Lynn Anderson): Lynn Anderson\nLynn Rene Anderson (September 26, 1947 – July 30, 2015) was an American country music singer known for a string of hits from the late 1960s to the 1980s, most notably her worldwide mega-hit \"Rose Garden\" (1970). Anderson's crossover appeal and regular exposure on national television helped her become one of country music's first female superstars in the early 1970s; taking the genre to venues around the world that previously had not been receptive. In 1970, she became the\n\nDocument (Title: I've Never Loved Anyone More): 1970. She did not return to the top ten again until 1979 with \"Isn't it Always Love\". The album was the only Columbia studio album of Anderson's not to be released on the cassette tape format.\nThe album was produced by Glenn Sutton, Anderson's husband and producer at the time, and has of 11 tracks. Two cover versions included here were hits from 1975, \"Faithless Love\" (a J. D. Souther composition best known as performed by Linda Ronstadt) and \"I'm Not\n\nQuestion: In 1970 Lynn Anderson signed with a record label founded in what year?\nAnswer: 1887\n\nDocument (Title: Bilocate): released, mixed and mastered by Jens Bogren (Opeth, Bloodbath, Katatonia, Paradise Lost, and others). The album received positive reviews from magazines and websites such as \"Decibel\" and Blabbermouth.net. The album was self-released and is now distributed in the United States via The Omega Order, the distribution <skip> . Points were awarded to the top twenty (World Tour) and sixty finishers (World Ranking) in the general classification and to the top five finishers in each stage. The points accrued by Chris Froome moved him up to third in the World Tour and second in the World Ranking. Peter Sagan held the lead of both rankings.'s strong showing put them in the lead of the World Tour team ranking, replacing. Spain and France remained the leaders\n\nDocument (Title: Pau Grand Prix): Grand Prix de Pau electric, the two races were won by the same winners as the previous year, but in reverse order; the first race was won by Adrien Tambay, the second by Mike Parisy. The participants included the Canadian driver Marc-Antoine Camirand (from Quebec) who, with his car in the colours of the Grand Prix de Trois-Rivières, was present to pay tribute to the Formula One driver Gilles Villeneuve and to bring the electric GP to Trois-Rivières.\nThe 2012 event received between\n\nDocument (Title: 2016 Monaco Grand Prix): after starting several quick laps only to abandon them to leave his final run to the last moment. He was however beaten to pole position by Ricciardo, who was almost three-tenths of a second faster than second placed Rosberg, with Vettel following in fourth almost a second slower. Nico Hülkenberg managed fifth ahead of Kimi Räikkönen, who was to serve a five-place grid penalty for an unscheduled gearbox change, leaving him eleventh on the grid. Carlos Sainz Jr., Sergio Pérez, Daniil Kvyat and Fernando Alonso rounded up\n\nDocument (Title: 2016 Spanish Grand Prix): pit lane for new tyres on lap 12, followed by race leader Ricciardo one lap later, making Verstappen the first Dutchman to lead a Grand Prix, before he came in another lap later. When Vettel made a pit stop on lap 16, he emerged third behind the two Red Bull drivers, all on the medium compound tyre.\nBy lap 20, Sebastian Vettel was closing the gap to the two Red Bulls ahead of him, coming within three seconds of Verstappen. On lap 22, Nico Hülkenberg retired when his\n\nQuestion: What is the nationality of the man who finished third in the 2016 Pau Grand Prix?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.16666666666666669,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Who gave the mother of Alberic II of Spoleto the title \"patricia\" of Rome?",
    "ground_truth": [
      "Pope John X"
    ],
    "streamingllm_pred": "Pope John VIII.",
    "baseline_pred": "Pope John X",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: New Jersey Institute of Technology): New Jersey Institute of Technology\nThe New Jersey Institute of Technology (NJIT) is a public research university in Newark, New Jersey. Founded in 1881 with the support of local industrialists and inventors especially Edward Weston, NJIT opened as Newark Technical School in 1885 with 88 students. The school grew into a classic engineering college – Newark College of Engineering – and then, with the addition of a School of Architecture in 1973, into a polytechnic university that now hosts five colleges and one school. As of fall 2018, the\n\nDocument (Title: New Jersey Institute of Technology): New Jersey Institute of Technology\nThe New Jersey Institute of Technology (NJIT) is a public research university in Newark, New Jersey. Founded in 1881 with the support of local industrialists and inventors especially Edward Weston, NJIT opened as Newark Technical School in 1885 with 88 students. The school grew into a classic engineering college – Newark College of Engineering – and then, with the addition of a School of Architecture in 1973, into a polytechnic university that now hosts five colleges and one school. As of fall 2018, the\n\nDocument (Title: Sri Sai University): Sri Sai University\nSri Sai University (SSU) is an engineering and professional university located in Palampur, Kangra district, Himachal Pradesh. It was established in 2011.\nLocation.\nThe nearest railway station is at Maranda, which is 2 km from Palampur and on narrow-gauge line between Pathankot and Joginder Nagar. The main bus station is located 1 km south of the main Bazaar. There is frequent bus service from Palampur to Dharamshala, Mandi, and Pathankot. Travelers can also make use of taxis to travel\n\nQuestion: New Jersey Institute of Technology and Sri Sai University, are higher education institutions?\nAnswer: yes\n\nDocument (Title: Beastie Boys): Beastie Boys\nThe Beastie Boys were an American hip hop group from New York City formed in 1981. The group comprised Michael \"Mike D\" Diamond (vocals, drums), Adam \"MCA\" Yauch (vocals, bass) and Adam <skip>  to Alberic, would seem to indicate\n\nDocument (Title: Duchy of Spoleto):, an important concession that can be compared to the as-yet uncontested Imperial right to invest territorial bishops, and perhaps at times a matter of contention between Emperor and Papacy, for Pope Adrian I had recently named a duke of Spoleto.\nIn 842 the former duchy was resurrected by the Franks to be held as a Frankish border territory by a dependent margrave. Among the more outstanding of the Frankish dukes, Guido I divided the duchy between his two sons Lambert and Guido II, who received as his share the lordship\n\nDocument (Title: Guy II of Spoleto): ed). \"Dizionario Biografico degli Italiani: LXI Guglielmo Gonzaga – Jacobini\". Rome, 2003.\n\nDocument (Title: Frederick II, Holy Roman Emperor): during the time he stayed in Germany between 1215 and 1220. According to some sources, she was related to the Hohenburg family under the name \"Alayta of Vohburg\" (it: Alayta di Marano); but the most accepted theory stated she was the daughter of Conrad of Urslingen, Count of Assisi and Duke of Spoleto.\n- Enzo of Sardinia (1215 –1272).\n- Caterina da Marano (1216/18 – aft. 1272), who married firstly with NN and secondly with Giacomo del Carretto, marquis\n\nDocument (Title: Faroald II of Spoleto): Faroald II of Spoleto\nFaroald II (also spelled Faruald) was the duke of Spoleto from 703, when he succeeded his own father Thrasimund I.\nFaroald ruled along with his mother Wachilap. He attacked and took Classis, the port of Ravenna, but he was ordered to return it by King Liutprand. Faroald also founded and endowed the monastery of San Pietro in Valle at Ferentillo. In 724, Faroald's son Thrasimund rebelled against his father and put him in a monastery.\nSources.\n- Paul the Deacon\n\nQuestion: Who gave the mother of Alberic II of Spoleto the title \"patricia\" of Rome?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.6666666666666666,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Who has the highest scope in profession in  Rob Thomas or  James Dean Bradfield",
    "ground_truth": [
      "James Dean Bradfield"
    ],
    "streamingllm_pred": "James Dean Bradfield has the highest scope in profession. He is a singer-songwriter, musician,",
    "baseline_pred": "James Dean Bradfield",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Kahan Commission): Kahan Commission\nThe Kahan Commission (ועדת כהן), formally known as the Commission of Inquiry into the Events at the Refugee Camps in Beirut, was established by the Israeli government on 28 September 1982, to investigate the Sabra and Shatila massacre (16–18 September 1982). The Kahan Commission was chaired by the President of the Supreme Court, Yitzhak Kahan. Its other two members were Supreme Court Judge Aharon Barak, and Major general (res.) Yona Efrat. The Commission was to make recommendations on Israeli involvement in the\n\nDocument (Title: Kahan Commission): Kahan Commission\nThe Kahan Commission (ועדת כהן), formally known as the Commission of Inquiry into the Events at the Refugee Camps in Beirut, was established by the Israeli government on 28 September 1982, to investigate the Sabra and Shatila massacre (16–18 September 1982). The Kahan Commission was chaired by the President of the Supreme Court, Yitzhak Kahan. Its other two members were Supreme Court Judge Aharon Barak, and Major general (res.) Yona Efrat. The Commission was to make recommendations on Israeli involvement in the\n\nDocument (Title: Aharon Barak): Aharon Barak\nAharon Barak (, born Erik Brick, 16 September 1936) is a Professor of Law at the Interdisciplinary Center in Herzliya and a lecturer in law at the Hebrew University of Jerusalem, the Yale Law School, Central European University, Georgetown University Law Center, and the University of Toronto Faculty of Law.\nBarak was President of the Supreme Court of Israel from 1995 to 2006. Prior to that, he served as a Justice of the Supreme Court of Israel (1978–95), as the Attorney General of\n\nQuestion: When was the Supreme Court Judge that was a member of the Kahan Commission born?\nAnswer: 16 September 1936\n\nDocument (Title: Eddie Guerrero): Eddie Guerrero\nEduardo Gory Guerrero Llanes (October 9, 1967 – November 13, 2005) was an American professional wrestler and a prominent member <skip> .\nBiography Early life.\nBorn in Tredegar, Monmouthshire, Bradfield attended the local Oakdale Comprehensive School where he suffered years of cruelty and bullying (he claims he was \"a Woody Allen-esque little nerd\") for his name (nicknamed Crossfire), lazy eye\n\nDocument (Title: Roland Thomas): Roland Thomas\nRoland Thomas was Dean of Bangor from 1570 until 1588.\n\nDocument (Title: Rob Thomas (musician)): In 2004, the Songwriters Hall of Fame awarded Thomas its first Hal David Starlight Award, recognizing young songwriters who have already had a lasting influence in the music industry.\nBiography.\nBiography 1972-1992: Early life.\nThomas was born February 14, 1972, in Landstuhl, West Germany, at Landstuhl Regional Medical Center, to Bill Thomas, a United States Army sergeant, and his wife Mamie (1951—2007) Thomas has an older half sister, Melissa, from his mother's previous marriage. The family\n\nDocument (Title: Rob Thomas (musician)): a son from a previous relationship, Maison Eudy, born on July 10, 1998.\nThomas claims that he is sometimes mistaken for television writer Rob Thomas, and vice versa. A conversation between the two men on this subject led to Thomas agreeing to perform a musical number as himself on the TV show \"iZombie\", penned by his namesake.\nPersonal life Charity work.\nThe Thomases are committed animal lovers and supporters of animal charities. Thomas and his wife have established the P Sidewalk Angels Foundation, a non\n\nDocument (Title: Peter Thomas): banker\n\nDocument (Title: Robert Hartford-Davis): Robert Hartford-Davis\nRobert Hartford-Davis (born William Henry Davis, 23 July 1923 – 12 June 1977) was a British born producer, director and writer, who worked on film and television in both in the United Kingdom and United States. He is also sometimes credited as Michael Burrowes or Robert Hartford.\nFilmography.\nHartford-Davis was born in Ramsgate, Kent in 1923 as William Henry Davis; he changed his name on becoming a television director in 1955. His television career encompassed drama, comedy\n\nDocument (Title: Robert Hoff): Robert Hoff\n\nQuestion: Who has the highest scope in profession in  Rob Thomas or  James Dean Bradfield\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.4,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Is The Devils of Loudun and Maskarade both operas?",
    "ground_truth": [
      "yes"
    ],
    "streamingllm_pred": "Yes, both are operas. The Devils of Loudun is an opera by Krzyszto",
    "baseline_pred": "yes",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: United States v. Nixon): United States v. Nixon\nUnited States v. Nixon, 418 U.S. 683 (1974), was a landmark United States Supreme Court case that resulted in a unanimous decision against President Richard Nixon, ordering him to deliver tape recordings and other subpoenaed materials to a federal district court. Issued on July 24, 1974, the decision was important to the late stages of the Watergate scandal, when there was an ongoing impeachment process against Richard Nixon. \"United States v. Nixon\" is considered a crucial precedent limiting the power of any U.S.\n\nDocument (Title: Kent v. Dulles): Kent v. Dulles\nKent v. Dulles, 357 U.S. 116 (1958), was a landmark 1958 United States Supreme Court case on the right to travel and passport restrictions as they relate to First Amendment free speech rights. It was the first case in which the U.S. Supreme Court made a distinction between the constitutionally protected substantive due process \"freedom of movement\" and the \"right to travel abroad\" (subsequently characterized as \"right to international travel\").\nBackground.\nFrom 1950 to 1955, Rockwell Kent repeatedly\n\nDocument (Title: United States v. Nixon): United States v. Nixon\nUnited States v. Nixon, 418 U.S. 683 (1974), was a landmark United States Supreme Court case that resulted in a unanimous decision against President Richard Nixon, ordering him to deliver tape recordings and other subpoenaed materials to a federal district court. Issued on July 24, 1974, the decision was important to the late stages of the Watergate scandal, when there was an ongoing impeachment process against Richard Nixon. \"United States v. Nixon\" is considered a crucial precedent limiting the power of any U.S.\n\nQuestion: Were United States v. Nixon and Kent v. Dulles both Supreme Court cases?\nAnswer: yes\n\nDocument (Title: Oasis (2002 film)): Oasis (2002 film)\nOasis () is a 2002 South Korean film directed by Lee Chang-dong. The film's plot tells about the difficult romance between a mildly mentally disabled man who has just been released from jail after a two and a half year sentence for involuntary manslaughter and a woman with <skip> \n- George Onslow: Le duc\n\nDocument (Title: The Devils of Loudun (opera)): opera, however, received some negative reviews as well. A critic, who said the presentation was marked by sensation and grandiosity, commented that the music was indescribably boring.\nOutside of Hamburg and Stuttgart, the opera received positive reviews in other German cities like Berlin, Cologne, Munich, and Mönchengladbach. For example, a slightly revised version of \"The Devils of Loudun\" was performed in West Berlin in 1970. A critic, who saw the performance, wrote that the presentation was \"an electrifying unforgettable experience.\n\nDocument (Title: Hilde Zaloscer): Le \"Doctor Faustus\" de Thomas Mann et ses modèles 1953\n- Zaloscer, Hilde De la composition musicale dans les oeuvres littéraires 1953\n- Zaloscer, Hilde Quelques considérations sur les rapports entre l’art copte et les Indes 1947\n\nDocument (Title: The Devils of Loudun (opera)): and unchastity. He is, consequently, sentenced to public torture and death at stake. Grandier's death thus becomes a realization of Jeanne's visions. Finally, Jeanne comes to realize that her unanswered love for Grandier was the cause of her possession.\nInterpretation.\nAndrzej Tuchowski states in \"Krzysztof Penderecki's Music in the Context of the 20th Century Theater\" that the most interesting aspect of the opera is Penderecki's sensitivity toward what goes on invisibly in the minds of almost all the characters in the opera: the\n\nDocument (Title: The Devils of Loudun (opera)): foot-stamping. Marseilles production of the opera, however, was praised for its set design and performers. \nThe British premiere in 1973, given by the Sadler's Wells Company, was not a great success either; the British critics were mostly unimpressed with the performance. The staging (by John Dexter) and the performers were praised, but the music was criticized for lack of drama and the libretto for its failure to arouse pity in the audience. One critic even cruelly wondered whether the Company's sparkling performance was\n\nQuestion: Is The Devils of Loudun and Maskarade both operas?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Who was the lead french actor who starred in the 1986 film that inspired a Stella Artois ad campaign?",
    "ground_truth": [
      "Gérard Depardieu"
    ],
    "streamingllm_pred": "Alain Delon. The film was \"Jean de Florette\" (1986), a French",
    "baseline_pred": "Gérard Depardieu",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Kahan Commission): Kahan Commission\nThe Kahan Commission (ועדת כהן), formally known as the Commission of Inquiry into the Events at the Refugee Camps in Beirut, was established by the Israeli government on 28 September 1982, to investigate the Sabra and Shatila massacre (16–18 September 1982). The Kahan Commission was chaired by the President of the Supreme Court, Yitzhak Kahan. Its other two members were Supreme Court Judge Aharon Barak, and Major general (res.) Yona Efrat. The Commission was to make recommendations on Israeli involvement in the\n\nDocument (Title: Kahan Commission): Kahan Commission\nThe Kahan Commission (ועדת כהן), formally known as the Commission of Inquiry into the Events at the Refugee Camps in Beirut, was established by the Israeli government on 28 September 1982, to investigate the Sabra and Shatila massacre (16–18 September 1982). The Kahan Commission was chaired by the President of the Supreme Court, Yitzhak Kahan. Its other two members were Supreme Court Judge Aharon Barak, and Major general (res.) Yona Efrat. The Commission was to make recommendations on Israeli involvement in the\n\nDocument (Title: Aharon Barak): Aharon Barak\nAharon Barak (, born Erik Brick, 16 September 1936) is a Professor of Law at the Interdisciplinary Center in Herzliya and a lecturer in law at the Hebrew University of Jerusalem, the Yale Law School, Central European University, Georgetown University Law Center, and the University of Toronto Faculty of Law.\nBarak was President of the Supreme Court of Israel from 1995 to 2006. Prior to that, he served as a Justice of the Supreme Court of Israel (1978–95), as the Attorney General of\n\nQuestion: When was the Supreme Court Judge that was a member of the Kahan Commission born?\nAnswer: 16 September 1936\n\nDocument (Title: The Decagon House Murders): The Decagon House Murders\nThe Decagon House Murders is a 1987 Japanese mystery novel and was the debut work of author Yukito Ayatsuji. <skip>  Manager\n- \"Business\" (1960) - Papillon\n- \"Fortunat\" (1960) - M. Dubroc\n- \"Le Sahara brûle\" (1961) - Joubert\n- \"Dans la gueule du loup\" (1961)\n- \"In The Water... Which Makes Bubbles!\n\nDocument (Title: Charles Heidsieck): as one of Champagne's premier houses.\nMedia portrayals.\nA 1989 French-Canadian television movie \"Champagne Charlie\" portrayed Heidsieck's life. He was played by English actor Hugh Grant.\nSee also.\n- List of wine personalities\nExternal links.\n- Official Site\n- Champagne Charlie (1989) - TV film starring Hugh Grant as Charles Heidsieck\n\nDocument (Title: Stella Artois): \".\nIn the 1980s and 1990s, the Stella Artois advertising slogan in the United Kingdom was \"Reassuringly Expensive\". The UK television advertising campaigns became known for their distinctive style of imitating European cinema and their leitmotiv inspired by Giuseppe Verdi's \"La forza del destino\". The campaigns began with a series of advertisements based on the 1986 French film \"Jean de Florette\", directed by the British duo Anthea Benton and Vaughan Arnell, moving on to other genres, including war films, silent comedy and even surrealism\n\nDocument (Title: Paul Amiot): - \"Il n'y a pas de fumée sans feu\" (1972)\n- \"The Train\" (1973) - François dit Verdun - un ancien combattant\n\nDocument (Title: Paul Hébert): \" (1971) - Le père / Father\n- \"Les jours gris\" (1974) - Un pensionnaire\n- \"Pardon Mon Affaire\" (1976) - (uncredited)\n- \"Happy Memories (Les Beaux Souvenirs)\" (1981) - Marie's father\n- \"Les Yeux rouges\" (1982) - Thomas\n- \"In the Shadow of the Wind (Les Fous de Bassan)\" (1987) - Timothé Brown\n- \"Les tisserands du pouvoir II: La Révolte\"\n\nQuestion: Who was the lead french actor who starred in the 1986 film that inspired a Stella Artois ad campaign?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Are Colocasia and Coronilla both flowering plants?",
    "ground_truth": [
      "yes"
    ],
    "streamingllm_pred": "Yes, both Colocasia and Coronilla are flowering plants. Colocasia is a genus of",
    "baseline_pred": "yes",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Erich Fromm): Erich Fromm\nErich Seligmann Fromm (; ; March 23, 1900 – March 18, 1980) was a German Jew who fled the Nazi regime and settled in the US. He was a social psychologist, psychoanalyst, sociologist, humanistic philosopher, and democratic socialist. He was one of the Founders of The William Alanson White Institute of Psychiatry, Psychoanalysis and Psychology in New York City and was associated with the Frankfurt School of critical theory.\nLife.\nErich Fromm was born on March 23, 1900, at Frankfurt am\n\nDocument (Title: Charles Nordhoff (journalist)): Charles Nordhoff (journalist)\nCharles Nordhoff (31 August 1830 – 14 July 1901) was an American journalist, descriptive and miscellaneous writer.\nBiography.\nHe was born in Erwitte, Germany (Prussia) in 1830, and emigrated to the United States with his parents in 1835. He was educated in Cincinnati, and apprenticed to a printer in 1843. In 1844, he went to Philadelphia where he worked for a short time in a newspaper office.\nHe then joined the United States Navy in 1845 (\n\nDocument (Title: Charles Nordhoff): Charles Nordhoff\nCharles Bernard Nordhoff (February 1, 1887 – April 10, 1947) was an American novelist and traveler, born in England.\nBiography.\nBiography Early life.\nCharles Nordhoff was born in London, England, on February 1, 1887, to American parents. His father was Walter Nordhoff, a wealthy businessman and author of \"The Journey of the Flame\" penned under the name \"Antonio de Fierro Blanco\". His mother, Sarah Cope Whitall, was of Pennsylvania Quaker stock. Nordhoff's\n\nQuestion: Were both Charles Nordhoff and Erich Fromm American writers?\nAnswer: no\n\nDocument (Title: Metallica (album)): \"Metallica\" sold 31 million copies worldwide on physical media. All five of \"Metallica\"s singles, \"Enter Sandman\", \"The Unforgiven\", \"Nothing Else Matters\", \"Wherever I May Roam\" and \"Sad but <skip> phagia accompanied by painful stinging and burning to the mouth and throat, with\n\nDocument (Title: Xanthosoma): Caladium\", \"Colocasia\" (taro), and \"Alocasia\".\nThe leaves of most \"Xanthosoma\" species are 40-200 cm long, sagittate (arrowhead-shaped) or subdivided into three or as many as 18 segments. Unlike the leaves of \"Colocasia\", those of \"Xanthosoma\" are usually not peltate- the upper v-notch extends into the point of attachment of the leaf petiole to the blade.\nEtymology.\nThe name is derived from the Greek words (\"xanthos\n\nDocument (Title: Corsia): \"et al.\" and became the third genus included in the family Corsiaceae. Zhang also remarked that \"Corsiopsis\" seem to be more closely related to \"Corsia\" than to \"Arachnitis\". Based on phylogenetic studies and reexamination of previous morphological studies, Neyland & Hennigan (2003) concluded that \"Corsia\" is not closely related to \"Arachnitis\". The former probably has closer affinities with Campynemataceae of Liliales, while the latter may be more closely related to \"Thismia\" and/or \"Burmannia\" of Dioscoreales.\n\nDocument (Title: Coriaria):.\nThe South American species \"C. ruscifolia\" is an evergreen climber known as deu or huique, and its fruits are used in Southern Chile to make rat poison.\n- Species\nFossil record.\nCoriariaceae fossils as pollen and seeds, are known from the Miocene of Europe.\n\nDocument (Title: Colocasia): Community call the root \"Kachalu\". They use it as a vegetable in the well known \"Sindhi curry\" and also as a fried vegetable with moong dal (green gram) in a Sindhi delicacy.\nIn Kerala state, the leaves are used to make chembila curry, and the roots are used in chembu puzhukku, a traditional accompaniment to Kerala chembu. Various other recipes also exist locally. The stem and root are also used in the preparation of stew and curry. The leaves were also used as umbrellas during\n\nQuestion: Are Colocasia and Coronilla both flowering plants?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "In which county was the English rock band formed that released the box set of four studio albums \"Genesis 1983–1998\"?",
    "ground_truth": [
      "Surrey"
    ],
    "streamingllm_pred": "Surrey. The band members, including Tony Banks, Mike Rutherford, and Phil Collins, had a",
    "baseline_pred": "Surrey",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: John Harrison (died 1669)): John Harrison (died 1669)\nSir John Harrison (c. 1590 – 28 September 1669) of Balls Park, Hertfordshire was an English politician who sat in the House of Commons variously between 1640 and 1669. He supported the Royalist side in the English Civil War.\nPublic Life.\nHarrison was born in Lancaster, the 12th son of a yeoman, and went to London in 1611 at the age of 22. He was one of the first to suggest the position of commissioner of the customs and was given that\n\nDocument (Title: John Harrison (died 1669)): John Harrison (died 1669)\nSir John Harrison (c. 1590 – 28 September 1669) of Balls Park, Hertfordshire was an English politician who sat in the House of Commons variously between 1640 and 1669. He supported the Royalist side in the English Civil War.\nPublic Life.\nHarrison was born in Lancaster, the 12th son of a yeoman, and went to London in 1611 at the age of 22. He was one of the first to suggest the position of commissioner of the customs and was given that\n\nDocument (Title: English Civil War): English Civil War\nThe English Civil War (1642–1651) was a series of armed conflicts and political machinations between Parliamentarians (\"Roundheads\") and Royalists (\"Cavaliers\") principally over the manner of England's governance. The first (1642–1646) and second (1648–1649) wars pitted the supporters of King Charles I against the supporters of the Long Parliament, while the third (1649–1651) saw fighting between supporters of King Charles II and supporters of the Rump Parliament. The war ended with Parliamentarian victory at the Battle of\n\nQuestion: Sir John Harrison supported the Royalist side of the English Civil War and these Royalists were also known by what other name?\nAnswer: Royalists (\"Cavaliers\")\n\nDocument (Title: Boca Río Gallegos): Boca Río Gallegos\nClub Boca Río Gallegos is an Argentine sports club from the city <skip>  Charisma Records. A remastered CD followed in 1994 by Virgin and Atlantic Records. In 2007, the album was released in a new stereo and 5.1 surround sound mix individually and as part of the \"Genesis 1976–1982\" studio album box set engineered by Nick Davis and Tony Cousins.\nPersonnel.\nTaken from the sleeve notes:\nGenesis\n- Phil Collins – vocals, drums, cymbals, percussion\n- Steve Hackett – electric guitars, nylon\n\nDocument (Title: Firth of Fifth): Firth of Fifth\n\"Firth of Fifth\" is a song by the British progressive rock band Genesis. It first appeared as the third track on the 1973 album \"Selling England by the Pound\", and was performed as a live piece either in whole or in part throughout the band's career.\nComposition.\nThe title is a pun on the estuary of the River Forth in Scotland, commonly known as the Firth of Forth. Though the song is credited to the entire band, most of the music was\n\nDocument (Title: Genesis (Genesis album)): and used.\nRelease.\n\"Genesis\" was released on 3 October 1983 and distributed by Charisma and Virgin Records in the United Kingdom and by Atlantic Records in the United States. It reached No. 1 on the UK Albums Chart for one week from 15 October 1983 during a fifty-one week stay on the chart, and re-entered the chart for a total of fifteen weeks between 1984 and 1987. The album peaked at No. 9 on the \"Billboard\" 200 during a forty-nine week\n\nDocument (Title: Genesis 1976–1982): an associated DVD which features audio versions of the albums in 5.1 surround sound, as well as videos for songs from that album or tour, new interviews and photo galleries.\nAudio formats.\nIn November 2006 Banks, Rutherford, and Collins announced they were reforming Genesis for the 2007. The announcement coincided with the release of three box sets containing digital remasters of the band's studio output across 2007 by EMI Records, containing new stereo and 5.1 surround sound mixes by producer and engineer Nick Davis.\nIn the European\n\nQuestion: In which county was the English rock band formed that released the box set of four studio albums \"Genesis 1983–1998\"?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.15384615384615385,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Do Singapore Sling and Fish House Punch both contain alcohol?",
    "ground_truth": [
      "yes"
    ],
    "streamingllm_pred": "Yes, both Singapore Sling and Fish House Punch contain alcohol. Singapore Sling is a gin-based",
    "baseline_pred": "Yes",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Fingathing): Fingathing\nFingathing are an instrumental Nu jazz / hip-hop band from Manchester, UK, comprising classically trained double bass player Sneaky, DJ / turntablist Peter Parker and Visual Artist Chris Cavetroll Drury.\nHistory.\nParker was a finalist at the UK DMC DJ Championship, where Mark Rae was on the judging panel. Parker later met Rae at the Fat City Records store in Manchester and was asked to audition for the Rae & Christian live backing band.\nParker performed along with Sneaky for Rae & Christian, before\n\nDocument (Title: Nu jazz): Nu jazz\nNu jazz, also known as jazztronica, is a genre of jazz and electronic music. The term was coined in the late 1990s to refer to music that blends jazz elements with other musical styles, such as funk, soul, electronic music, and free improvisation.\nOverview.\nAccording to critic Tony Brewer,\nNu jazz ranges from combining live instrumentation with beats of house, exemplified by St Germain, Jazzanova and Fila Brazillia, to more band-based improvised jazz with electronic elements, such as\n\nDocument (Title: DJ Sneak): his independent label – Defiant Records.\nIn 1994, while still working at local store Gramophone Records, Sneak met Cajmere (Green Velvet) owner of Cajual and Relief Records. Cajmere released three of Sneak's catalyst tracks, which helped bring him international recognition.\nIn Ibiza, Sneak has participated in several events with Ministry of Sound, Cream, Manumission, and Miss Moneypenny's. Sneak currently resides in Los Angeles, California, US.\nLyrics by DJ Sneak are featured in the Daft Punk song, \"Digital\n\nQuestion: A jazztronica band from Manchester features bass player Sneaky and what visual artist?\nAnswer: Chris Cavetroll Drury\n\nDocument (Title: Henry Koster (author)): at Google books, full view)\n\nDocument (Title: Henry Koster): Henry Koster\nHenry Koster (born Hermann Kosterlitz, May 1, 1905 – September 21, 1988) was a German-born film director. He was the husband of actress Peggy Moran.\nEarly life.\nKoster was born to <skip> External links.\n- Yellowstripe scad (\"Selaroides\n\nDocument (Title: Singaporean cuisine): steamed white rice smothered in a mess of curries and braised gravy.\n- Har cheong gai (), chicken wings fried in a batter with fermented shrimp paste.\n- Hokkien mee (), egg noodles and rice noodles stir-fried with egg, slices of pork, prawns and squid, and served and garnished with spring onion, lard, sambal chilli and lime (for adding lime juice to the dish).\n- Hum chim peng (), a deep-fried bun-like pastry sometimes filled\n\nDocument (Title: Bak kut teh): dried squid are added. Unlike the original rib soup, the \"dry\" version has a tangier, sharper taste and is more akin to a herbal stew than the classical broth. It is often recommended locally in Malaysia as an excellent hangover cure.\nIn Malaysia, a less fatty variation of \"bak kut teh\" made with chicken instead of pork is called \"chik kut teh\". It also serves as a \"halal\" version of the dish catered to Muslims, whose religion forbids them to consume pork.\n\nDocument (Title: Singapore Sling): Singapore Sling\nThe Singapore Sling is a gin-based cocktail from Singapore. This long drink was developed sometime before 1915 by Ngiam Tong Boon, a Hainanese bartender working at the Long Bar in Raffles Hotel, Singapore. It was initially called the gin sling – a \"sling\" was originally a North American drink composed of spirit and water, sweetened and flavored.\nHistory.\nD. A. Embury stated in the \"Fine Art of Mixing Drinks\": \"Of all the recipes published for [this drink] I\n\nDocument (Title: Singaporean cuisine): ginger and thick black sauce in a claypot with porridge in another claypot.\n- Hae mee (), stir-fried prawn noodles cooked in a broth made from prawn heads and pork bones, topped with ingredients such as prawns, sliced pork belly, squid, egg, lard, and served with sambal chilli and lime at the side.\n- Hainanese chicken rice () is based on the Hainanese dish Wenchang chicken. It is considered Singapore's national dish.\n- Hainanese curry rice is a dish consisting of\n\nQuestion: Do Singapore Sling and Fish House Punch both contain alcohol?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Faces is a mixtape that features guest appearances from an American rapper who released one album with Souf Folk called what?",
    "ground_truth": [
      "Country Thuggin"
    ],
    "streamingllm_pred": "Acid Rap. Chance the Rapper released one album with Souf Folk called Acid Rap. Noname",
    "baseline_pred": "Country Thuggin",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Ip Man 2): clothing in show of mourning; there was a moment of silence for the victims of the disaster. The film's cast, Donnie Yen, Sammo Hung, Huang Xiaoming, Lynn Hung, and Kent Cheng attended the premiere, and donated a total of ¥500,000 (US$73,200) to relief efforts helping in the disaster recovery. The film held private screenings in Chengdu on 21 April 2010, and in China on 27 April 2010, receiving positive reactions from audiences. Mandarin Films has sold North American distribution rights for the film\n\nDocument (Title: Donnie Yen): Donnie Yen\nDonnie Yen Ji-dan (; born 27 July 1963) is a Hong Kong actor, martial artist, film director, producer, action choreographer, stuntman and multiple-time world wushu tournament champion.\nYen is one of Hong Kong's top action stars. Yen has displayed skill in an array of martial arts, being well-versed in Tai Chi, Boxing, Kickboxing, Jeet Kune Do, Hapkido, Taekwondo, Karate, Muay Thai, Wrestling, Brazilian Jiu-Jitsu, Judo, Wing Chun\n\nDocument (Title: Ip Man (TV series)): \"Ip Man 2\" (starring Donnie Yen), and Taiwanese producer Young Pei-pei served as the artistic consultants for the series, while Ip Man's sons, Ip Chun and Ip Ching, served as the martial arts consultants. The series was shot from July–November 2012 in Kunshan, Suzhou, and was first aired on Shandong TV from 24 February to 9 March 2013. It won the Golden Eagle Award for Best Television Series in 2012.\nCast.\n- Kevin Cheng as Ye Wen\n-\n\nQuestion: What Hong Kong actor starred in Ip Man 2?\nAnswer: Donnie Yen\n\nDocument (Title: William Sarokin): William Sarokin\nWilliam Sarokin is an American sound engineer. He was nominated for an Academy Award in the category Best Sound Mixing for the film \"Salt\". He has worked on over 80 films since 1984.\nSelected filmography.\n- \"Salt\" (2010)\n\nDocument (Title: Salt (2010 film <skip>  to the Trap House\" (2007). The album was released exclusively to digital download retailers on May 21, 2013 independently by 1017 Brick Squad Records and 101 Distribution. The project features guest appearances from Rick Ross, Rich Homie Quan, Wiz Khalifa, Shawty Lo, Young Scooter, Young Thug and Chief Keef among others.\nBackground.\nOn February 21,\n\nDocument (Title: Dash (rapper)): V.I.C.E.S\", as well as appearing with him on Mac Miller's track, \"New Faces\".\nMusical career 2015–present: \"Skrewface\" and \"17 More Minutes\".\nIn 2015, Da$h released an EP titled \"Skrewface,\" followed by a mixtape titled \"17 More Minutes.\" Music videos were released on Da$h's YouTube page for the tracks \"RicHie K II,\" \"Hello,\" and \"Seymour,\" along with a short video series, \"DEADMANWALKIN,\" a documentary-style\n\nDocument (Title: Days Before Rodeo): Days Before Rodeo\nDays Before Rodeo is the second mixtape by American rapper Travis Scott. It was released for free on August 18, 2014, by Grand Hustle Records. The mixtape features guest appearances from Young Thug, Big Sean, The 1975, Rich Homie Quan, Migos, T.I. and Peewee Longway.\nBackground and promotion.\nIn August 2014, Scott announced on his Twitter account that he would be releasing 10 new songs within a month. On the same day, he also tweeted the title of this project\n\nDocument (Title: Pouya (rapper)): -Harmony influenced, saying \"he does a great job of molding their style into his own version with a twist of his own style thrown in there.\" His next mixtape would be released on March 25, 2015, entitled \"South Side Slugs\". The mixtape would contain guest appearances from Sir Michael Rocks, Denzel Curry, SDotBraddy, Alex Wiley, Fat Nick, Germ and Mikey The Magician. Pouya collaborated with SuicideBoys on an EP, \"$outh$ide$uicide\", that was released on September 1, 2015.\n\nQuestion: Faces is a mixtape that features guest appearances from an American rapper who released one album with Souf Folk called what?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "When was the English rock band formed that's first recording remained unreleased for three years?",
    "ground_truth": [
      "June 1975"
    ],
    "streamingllm_pred": "1976 (Motörhead) Answer: 1976 (Motörhead) Answer:",
    "baseline_pred": "June 1975",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Mis'ry's Comin' Aroun): Mis'ry's Comin' Aroun\nMis'ry's Comin' Aroun is a once-neglected song from the 1927 musical \"Show Boat\" by Jerome Kern and Oscar Hammerstein II. It was cut from the production during the Washington D.C. tryout on the orders of producer Florenz Ziegfeld, supposedly because it was one of the factors that made the show too long (it ran four-and-a-half hours when it premiered). However, musical theatre historian Miles Kreuger and conductor John McGlinn, also suggest that it was the\n\nDocument (Title: Oscar Hammerstein II): Oscar Hammerstein II\nOscar Greeley Clendenning Ritter von Hammerstein II (; July 12, 1895 – August 23, 1960) was an American librettist, theatrical producer, and (usually uncredited) theatre director of musicals for almost 40 years. He won eight Tony Awards and two Academy Awards for Best Original Song. Many of his songs are standard repertoire for vocalists and jazz musicians. He co-wrote 850 songs. \nHammerstein was the lyricist and playwright in his partnerships; his collaborators wrote the music. Hammerstein collaborated with numerous\n\nDocument (Title: Mis'ry's Comin' Aroun): Mis'ry's Comin' Aroun\nMis'ry's Comin' Aroun is a once-neglected song from the 1927 musical \"Show Boat\" by Jerome Kern and Oscar Hammerstein II. It was cut from the production during the Washington D.C. tryout on the orders of producer Florenz Ziegfeld, supposedly because it was one of the factors that made the show too long (it ran four-and-a-half hours when it premiered). However, musical theatre historian Miles Kreuger and conductor John McGlinn, also suggest that it was the\n\nQuestion: When was the person who helped write Mis'ry's Comin' Aroun born?\nAnswer: July 12, 1895\n\nDocument (Title: Electoral district of Napier): Electoral district of Napier\nNapier was an electorate in the South Australian Legislative Assembly in the outer northern suburbs of <skip> \n\nDocument (Title: Family (band)): UK and US Reprise) and their debut album \"Music in a Doll's House\", was recorded during early 1968. Miller was originally slated to produce it, but he was tied up with production of The Rolling Stones' album \"Beggar's Banquet\" and he is credited as co-producer on only two tracks, \"The Breeze\" and \"Peace of Mind\". The bulk of the album was produced by former Traffic member Dave Mason, and recorded at London's Olympic Studios with engineers Eddie Kramer and\n\nDocument (Title: Official Secrets Act (band)): Official Secrets Act (band)\nOfficial Secrets Act (OSA) was a pop-rock band from London, England. Thomas Burke, Alexander Mackenzie, and Lawrence Diamond formed a band at Leeds University after bonding over an interest in British military history. Michael Evans joined after catching one of their early gigs.\nThe band has drawn inspiration from both British and American guitar-based bands, such as Talking Heads, Futureheads and Blur. \nOSA was the first band to perform in Black Cab Sessions's the Secret\n\nDocument (Title: Delay 1968): Delay 1968\nDelay 1968, or just Delay (as the SACD version is titled), is a compilation album of early outtakes by German experimental rock band Can during its work with singer Malcolm Mooney, including some of the band's earliest material. It notably features the song \"The Thief\", a slightly longer version of which had already been released officially on the United Artists compilation album \"Electric Rock\" in 1970. The track was later covered live by Radiohead.\nHolger Czukay has said that \"Delay 1968\n\nDocument (Title: A Saucerful of Secrets): Last Scream\", both recorded on 7–8 August 1967. The two tracks were arranged to be released as a single on 8 September, before it was vetoed by the band's record company, EMI. The band recorded \"Vegetable Man\" at De Lane Lea Studios on 9–11 October, and returned later in the month, on 19 October, to record \"Jugband Blues\", with producer Norman Smith booking a Salvation Army band, at Barrett's request. During these sessions, Barrett overdubbed a slide-guitar part onto\n\nQuestion: When was the English rock band formed that's first recording remained unreleased for three years?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "What school did the team, whose only sophomore starter went on to play eleven seasons with the Atlanta Falcons, represent in the 1963 college football season?",
    "ground_truth": [
      "University of Texas at Austin"
    ],
    "streamingllm_pred": "University of Texas at Austin.  The team, whose only sophomore starter went on to play eleven seasons",
    "baseline_pred": "University of Texas at Austin",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Scott Draper): Scott Draper\nScott Dennis Draper (born 5 June 1974) is an Australian former tennis player and golfer. He won the Australian Open Mixed Doubles with Sam Stosur in 2005. Draper also reached the fourth round of the 1995 and 1996 French Opens, and the fourth round of the US Open in 1997. His most significant achievement in singles was winning the 1998 Queen's Club Championships, the lowest ranked player ever to do so. \nPersonal life.\nDraper was born in Queensland, Australia. He married his first\n\nDocument (Title: Scott Draper):, one stroke ahead of Andrew Bonhomme and Aaron Townsend. Draper played as a professional golfer from 2005 to 2008 when a back injury ended his professional career. Although he played tennis left-handed, he played golf right-handed.\n\nDocument (Title: Kevin Curren): Kevin Curren\nKevin Melvyn Curren (born 2 March 1958) is a South African former professional tennis player. He played in two Grand Slam singles finals and won four Grand Slam doubles titles, reaching a career-high singles ranking of World No. 5.\nPersonal life.\nCurren was born in South Africa, and he became a naturalized American citizen in April 1985.\nTennis career.\nCurren played both tennis and cricket at Glenwood High School in Durban. He also quickly rose among the ranks as a\n\nQuestion: Did Scott Draper or Kevin Curren play more sports?\nAnswer: Scott Dennis Draper (born 5 June 1974) is an Australian former tennis player and golfer.\n\nDocument (Title: Mickey and the Roadster Racers): Mickey and the Roadster Racers\nMickey and the Roadster Racers is an American computer-animated children's television series produced by Disney Television Animation. It is the second spin-off of \"Mickey Mouse Clubhouse,\" the first being \"Minnie's Bow-Toons.\" The series debuted on Disney Junior and Disney Channel in the United States on January 15, 2017. \nThe series was renewed for a second season on March 15, 2017, which premiered on April 13, 2018 <skip> Title: 1963 San Diego State Aztecs football team): not drafted, but played in the NFL/AFL.\n\nDocument (Title: 1963 Big Ten Conference football season): The Big Ten's statistical leaders included Tom Myers of Northwestern with 1,398 passing yards, Tom Nowatzke of Indiana with 756 rushing yards, and Paul Krause of Iowa with 442 receiving yards. Carl Eller of Minnesota was the first Big Ten player selected in the 1964 NFL Draft with the sixth overall pick.\nSeason overview.\nSeason overview Results and team statistics.\nKeybr\nAP final = Team's rank in the final AP Poll of the 1963 seasonbr\nAP high = Team's highest rank in the AP Poll throughout the\n\nDocument (Title: 1963 Mississippi State Bulldogs football team): of the Year in honor of the team's surprise success.\n\nDocument (Title: 1963 Sugar Bowl): named Sugar Bowl MVP.\n\nDocument (Title: 1963 Michigan Wolverines football team): 1963 Michigan Wolverines football team\nThe 1963 Michigan Wolverines football team represented the University of Michigan in the 1963 Big Ten Conference football season. In its fifth year under head coach Bump Elliott, Michigan compiled a 3–4–2 record (2–3–2 against conference opponents), tied for fifth place in the Big Ten, and outscored opponents by a combined total of 131 to 127.\nThe highlight of the season was an upset victory over No. 2 Illinois led by Dick Butkus; the game was the only loss suffered by the 1963 Illinois\n\nDocument (Title: 1964 College Football All-America Team): Kansas\n- Donny Anderson, Texas Tech\n- Floyd Little, Syracuse\n- Mike Garrett, USC\n- Jim Grabowski, Illinois\n- Tom Nowatzke, Indiana\n- Larry Dupree, Florida\n- Brian Piccolo, Wake Forest\n- Jim Grisham, Oklahoma\n- Cosmo Iacavazzi, Princeton\n- Ken Willard, North Carolina\nDefense.\nDefense Defensive ends.\n- Allen Brown, Mississippi\n- Ray Rissmiller, Georgia\n- Al Atkinson, Villanova\n- Alphonse Dotson, Grambling\n- Harold Wells,\n\nQuestion: What school did the team, whose only sophomore starter went on to play eleven seasons with the Atlanta Falcons, represent in the 1963 college football season?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.47619047619047616,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Nostie lies a short distance from one of Scotland's popular tourist attractions a small tidal island dominated by a picturesque castle that frequently apperas in what?",
    "ground_truth": [
      "photographs, film and television"
    ],
    "streamingllm_pred": "Nostie lies a short distance from one of Scotland's popular tourist attractions, Eilean Don",
    "baseline_pred": "photographs, film and television",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Frank Serpico): Frank Serpico\nFrancesco Vincent Serpico (born April 14, 1936) is a former New York City Police Department (NYPD) officer who holds both American and Italian citizenship. He is known for whistleblowing on police corruption in the late 1960s and early 1970s, an act that prompted Mayor John V. Lindsay to appoint the landmark Knapp Commission to investigate the NYPD. Much of Serpico's fame came after the release of the 1973 film \"Serpico\", which was based on the book by Peter Maas and which starred Al Pacino in\n\nDocument (Title: Knapp Commission): Knapp Commission\nThe Commission to Investigate Alleged Police Corruption (known informally as the Knapp Commission, after its chairman Whitman Knapp) was a five-member panel initially formed in April 1970 by Mayor John V. Lindsay to investigate corruption within the New York City Police Department. The creation of the commission was largely a result of the publicity generated by the public revelations of police corruption made by Patrolman Frank Serpico and Sergeant David Durk. The commission confirmed the existence of widespread corruption and made a number of recommendations.\nMembers.\n\nDocument (Title: Knapp Commission): Knapp Commission\nThe Commission to Investigate Alleged Police Corruption (known informally as the Knapp Commission, after its chairman Whitman Knapp) was a five-member panel initially formed in April 1970 by Mayor John V. Lindsay to investigate corruption within the New York City Police Department. The creation of the commission was largely a result of the publicity generated by the public revelations of police corruption made by Patrolman Frank Serpico and Sergeant David Durk. The commission confirmed the existence of widespread corruption and made a number of recommendations.\nMembers.\n\nQuestion: The Commission to Investigate Alleged Police Corruption (known informally as the Knapp Commission) became informed of Frank Serpico's police corruption by him doing what?\nAnswer: whistleblowing\n\nDocument (Title: Ian Juryeff): Ian Juryeff\nIan Martin Juryeff (born 24 November 1962) is an English former professional footballer who played as a forward for various Football League clubs in the 1980s and 1990s. He started <skip>  which can be accessed along the A9 road, or the coast road, where it is now almost merged of North Kessock. The biggest town to the west, about 9 miles is Muir of Ord. The village of Tore, about 5 miles to the northeast of Charleston, accessed by the A9. Directly north is the small village of Munlochy on Munlochy Bay.\nGeography.\n\nDocument (Title: St Monans): St Monans\nSt Monans (, ), often spelt St Monance, is a village and parish in the East Neuk of Fife and is named after the legendary Saint Monan. Situated approximately 3 miles west of Anstruther, this small community, whose inhabitants formerly made their living mainly from fishing, is now a tourist destination situated on the Fife Coastal Path. The former burgh rests on a hill overlooking the Firth of Forth, with views to North Berwick, the Bass Rock and the Isle of May. St Monans contains many historical\n\nDocument (Title: Wigtownshire): Mull of Galloway Lighthouse at the southernmost point of Scotland, which includes a visitor centre and RSPB nature reserve.\n- Sorbie Tower\n- Wigtown Castle\n- Historic Scotland properties:\n- Castle of Park\n- Glenluce Abbey\n- St Ninian's Chapel at the Isle of Whithorn, and St Ninian's Cave, two miles north-west\n- Kirkmadrine Monogram Stones\n- Rispain Camp\n- Torhousekie Stone Circle, dating from the 2nd millennium BC, this is one of the best preserved sites in Britain.\n\nDocument (Title: Kilcreggan): Kilcreggan the road reaches the village of Rosneath then continues north along the shores of the Gare Loch.\nThe majority of the houses look south across the Clyde towards the towns of Gourock and Greenock, and further down the firth towards the Isle of Arran.\nLarge attractive houses continue westwards from the pier towards \"Baron's Point\" which marks the southern entrance to Loch Long, almost to the adjoining village of Cove which looks across \"Cove Bay\" towards Blairmore only about 2 miles (3 km) distant\n\nQuestion: Nostie lies a short distance from one of Scotland's popular tourist attractions a small tidal island dominated by a picturesque castle that frequently apperas in what?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Which band opened for more major international acts, Blessid Union of Souls or Blue Peter?",
    "ground_truth": [
      "Blue Peter"
    ],
    "streamingllm_pred": "Blue Peter. According to the documents, Blue Peter opened for bands such as Genesis, Queen, and",
    "baseline_pred": "Blue Peter",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Pinetop Perkins): Pinetop Perkins\nJoe Willie \"Pinetop\" Perkins (July 7, 1913 – March 21, 2011) was an American blues pianist. He played with some of the most influential blues and rock-and-roll performers of his time and received numerous honors, including a Grammy Lifetime Achievement Award and induction into the Blues Hall of Fame.\nLife and career.\nLife and career Early career.\nPerkins was born in Belzoni, Mississippi and raised on a plantation in Honey Island, Mississippi. He began his career\n\nDocument (Title: Born in the Delta): Born in the Delta\nBorn in the Delta is an album by blues pianist Pinetop Perkins that was released on May 27, 1997. Perkins was 83 years old when he recorded the album in 1996, having begun his recording career late in life.\nMusicians.\n1. Pinetop Perkins - piano, vocals\n2. Tony O. - guitar (Anthony O. Melio is a member of Little Mike and the Tornadoes)\n3. Jerry Portnoy - harmonica (on \"Murmur Low\")\n4. Willie \"\n\nDocument (Title: Born in the Delta): Born in the Delta\nBorn in the Delta is an album by blues pianist Pinetop Perkins that was released on May 27, 1997. Perkins was 83 years old when he recorded the album in 1996, having begun his recording career late in life.\nMusicians.\n1. Pinetop Perkins - piano, vocals\n2. Tony O. - guitar (Anthony O. Melio is a member of Little Mike and the Tornadoes)\n3. Jerry Portnoy - harmonica (on \"Murmur Low\")\n4. Willie \"\n\nQuestion: When was the pianist that had the Born in the Delta born? \nAnswer: July 7, 1913\n\nDocument (Title: We Found Love): According to Elan, the keyboard work in the song bears resemblance to that in from \"Only Girl (In the World)\" and the melody is similar to that of \"Complicated\", a track included in Rihanna's 2010 studio album \"Loud\". Similarly, Michael Cragg of \"The Guardian\" noted <skip>  the 1920s to the 1950s. He has specialised in this genre ever since and performed regularly with internationally acclaimed artists such as Keith Nichols and The Blue Devils, The Pasadena Roof Orchestra and for 10 years he performed with The Rio Trio (1986-\n\nDocument (Title: Blessid Union of Souls): Blessid Union of Souls\nBlessid Union of Souls (sometimes abbreviated to Blessid Union or BUOS) is an American alternative rock band from Cincinnati, Ohio that was formed in 1990 by friends Jeff Pence and Eliot Sloan.\nThe band's first studio album, \"Home\", had some success which lay with its lead single, \"I Believe\". The song popularized the band with local-area DJs and is the group's most successful song. Their second album, the self-titled \"Blessid Union of Souls\n\nDocument (Title: 2015 in British music):.\n- Karl Jenkins – \"Still with the Music\"\nArtists and groups reformed.\n- Bay City Rollers\n- Black Grape\n- The Bluetones\n- Busted\n- Faithless\n- The King Blues\n- Lush\n- Simply Red\n- Supertramp\n- We've Got a Fuzzbox and We're Gonna Use It\nGroups on hiatus.\n- The Saturdays\nGroups disbanded.\n- Does It Offend You, Yeah?\n- Heart In Hand\n- Flesh for Lulu\n-\n\nDocument (Title: Blessid Union of Souls):.\nDiscography.\nDiscography Singles.\nThey also performed a track in \"\" titled \"Brother My Brother\" and the main theme for \"\" titled \"It's Alright\".\nExternal links.\n- The current band's official site\n\nDocument (Title: Redrum (band)): Roach, Anoyo, and Durga, as well 1980's groups such as Gastunk, The Blue Hearts, ARB, The Roosters and The Stalin.\nHistory.\nHistory Formation.\nRedrum is a four-piece band that was started with the notion of \"making Japan's very own Portishead-like band\". In 1996, drummer Kazihara Kouji, stagename Kazi, made this declaration to guitarist Takeuchi Tsuyoshi, whom he had met at a former job and soon after became acquainted with vocalist Kitayama Yumi and the three started\n\nQuestion: Which band opened for more major international acts, Blessid Union of Souls or Blue Peter?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.23529411764705882,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Stockely Webster has paintings hanging in what home (that serves as the residence for the Mayor of New York)?",
    "ground_truth": [
      "Gracie Mansion"
    ],
    "streamingllm_pred": "The home of the Mayor of New York is Gracie Mansion, and Stockely Webster has paintings hanging",
    "baseline_pred": "Gracie Mansion",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Jon Jost): Jon Jost\nJon Stephen Jost (born 16 May 1943 in Chicago) is an American independent filmmaker.\nBorn in Chicago to a military family, he grew up in Georgia, Kansas, Japan, Italy, Germany and Virginia. He began making films in January 1963 after being expelled from college. In 1965 he was imprisoned by US authorities for 2 years 3 months for refusal to cooperate with the Selective Service system. On his release he became engaged in anti-war activities, working for the draft resistance, Chicago\n\nDocument (Title: Veasey): soprano, associated with Wagner and Berlioz roles\n- Nick Veasey, British photographer working primarily with images created from X-ray imaging\n- Pam Veasey (born 1962), American television writer, producer and director\n- Sigrid Veasey, American physician and sleep researcher\n\nDocument (Title: Pam Veasey): Pam Veasey\nPamela Renea Veasey (born May 25, 1962) is an American television writer, producer and director.\nCareer.\nVeasey graduated from the University of Southern California with degrees in Journalism and Political Science. She began her writing career in 1985, writing an episode of \"What's Happening Now!!\" Before that she worked as receptionist behind-the-scenes of the sitcom \"Gimme a Break!\", eventually writing six episodes for the series. In 1990, she became a writer on\n\nQuestion: Are Pam Veasey and Jon Jost both American?\nAnswer: yes\n\nDocument (Title: Hugh Grant): Hugh Grant\nHugh John Mungo Grant (born 9 September 1960) is an English actor and film producer. Grant has received a Golden Globe, a BAFTA, and an Honorary César for his work., his films have grossed a total of nearly US$3 billion worldwide from 29 theatrical releases. He first received attention after earning the Volpi Cup for his performance in the film \"Maurice\" (1987) but achieved international success after appearing in \"Four Weddings and a Funeral\" (1994). He used\n\nDocument (Title: Mickey Blue Eyes): Mickey Blue Eyes\nMickey <skip>  1876 in art\n- List of sculptures\n\nDocument (Title: Ralph Fasanella): exhibits.\nFasanella's paintings may be found in the following permanent collections and public spaces:\n- Fifth Avenue / 53rd Street subway station, New York City, NY\n- Addison Gallery of American Art, Andover, MA\n- Baseball Hall of Fame, Cooperstown, NY\n- Communications Workers of America Headquarters Building, Washington, D.C.\n- Ellis Island Immigration Museum, Ellis Island, NY\n- Flint Public Library, Flint, MI\n- Heritage State Park Visitors' Center, Lawrence, MA\n-\n\nDocument (Title: Albany, New York): in America.\nThe Albany Institute of History and Art, on Washington Avenue near the Center Square Neighborhood and State Capitol, is \"dedicated to collecting, preserving, interpreting and promoting interest in the history, art, culture of Albany and the Upper Hudson Valley region.\" The museum's most notable permanent exhibits include an extensive collection of paintings by the Hudson River School and an exhibit on Ancient Egypt featuring the Institute's \"Albany Mummies.\"\nAlbany is home to 57 listings on the National Register of Historic Places\n\nDocument (Title: Hunt Slonem): among others. \"I'm a big fan of Hunt's work,\" Brooke Shields told \"Daily Front Row\". \"It's whimsical without being too sweet.\" A March 2012 issue of \"Architectural Digest\" features Shields's Manhattan townhouse, with three of Slonem's \"rabbit paintings\" prominently displayed on her living room wall.\nOver fifty museums internationally include Hunt Slonem's paintings in their collections, among them the Smithsonian American Art Museum; the National Gallery of Art in Washington, D.C.; the Brooklyn\n\nDocument (Title: Meg Webster): Guggenheim Museum, New York, New York\n- \"Spirit of the Matter\", Grand Salon, New York, New York\n- 1994\n- \"Landscape as Metaphor\", Denver Art Museum, Denver, Colorado; Columbus Museum of Art, Columbus, Ohio\n- \"Urban Paradise: Gardens in the City\", Public Art Fund, PaineWebber Gallery, New York, New York\n- \"Visceral Responses\", Holly Solomon Gallery, New York, New York\n- 1993\n- \"Dialogues with\n\nQuestion: Stockely Webster has paintings hanging in what home (that serves as the residence for the Mayor of New York)?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.23529411764705882,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "The View from the Bottom is the fifth studio album by an American rock band best known for what hit song?",
    "ground_truth": [
      "My Own Worst Enemy"
    ],
    "streamingllm_pred": "The View from the Bottom is the fifth studio album by an American rock band best known for the hit",
    "baseline_pred": "My Own Worst Enemy",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: The Great Southern Trendkill): The Great Southern Trendkill\nThe Great Southern Trendkill is the eighth studio album by American heavy metal band Pantera, released on May 7, 1996 by EastWest Records. It reached number 4 on the \"Billboard\" 200 chart, and managed to stay on the chart for 16 weeks. Due to tension and conflicts within the band, Phil Anselmo recorded the vocals alone at Trent Reznor's Nothing Studios in New Orleans while Dimebag Darrell, Rex Brown and Vinnie Paul recorded the music at Chasin Jason Studios in Dalworthington Gardens.\nContent\n\nDocument (Title: Walk Through Exits Only): Walk Through Exits Only\nWalk Through Exits Only is the debut solo album by former Pantera frontman Phil Anselmo. It was released in July 16, 2013 under Anselmo's own label, Housecore Records. This album has been compared to Pantera's 1996 album The Great Southern Trendkill due to Anselmo's extreme vocals and very heavy guitar riffs.\nPersonnel.\nPersonnel Philip H. Anselmo & The Illegals.\n- Phil Anselmo − vocals\n- Marzi Montazeri − guitars\n- Bennett Bartley − bass guitar\n- Joe Gonzalez − drums\n\nDocument (Title: Walk Through Exits Only): Walk Through Exits Only\nWalk Through Exits Only is the debut solo album by former Pantera frontman Phil Anselmo. It was released in July 16, 2013 under Anselmo's own label, Housecore Records. This album has been compared to Pantera's 1996 album The Great Southern Trendkill due to Anselmo's extreme vocals and very heavy guitar riffs.\nPersonnel.\nPersonnel Philip H. Anselmo & The Illegals.\n- Phil Anselmo − vocals\n- Marzi Montazeri − guitars\n- Bennett Bartley − bass guitar\n- Joe Gonzalez − drums\n\nQuestion: Walk Through Exits Only is a solo album by Phil Anselmo, former member of which heavy metal band?\nAnswer: Pantera\n\nDocument (Title: Loving (1970 film)): Loving (1970 film)\nLoving is a 1970 American comedy film <skip>  Out Boy discography): Take This to Your Grave\", in May 2003. Following the album's release, the band signed with major label Island Records. Their second studio album \"From Under the Cork Tree\" was released in May 2005 to great commercial success, peaking at number nine on the United States \"Billboard\" 200 and being certified 2x platinum by the Recording Industry Association of America (RIAA). The album's popularity was aided by the success of its first two singles, \"Sugar, We're Goin Down\" and \"\n\nDocument (Title: John 5 (guitarist)): - \"I Want It All\" (July 31, 2019)\nDiscography Loser.\nAlbums\n- \"Just Like You\" (2006)\nSingles\n- \"Disposable Sunshine\" (\"\", 2005)\n- \"Nobody Knows\" (2006)\n- \"The First Time\" (2006)\nDiscography Marilyn Manson.\nAlbums\n- \"Mechanical Animals\" (1998, credited as live guitarist)\n- \"The Last Tour on Earth\" (1999, live album)\n- \"Holy\n\nDocument (Title: Hard to See): Hard to See\n\"Hard to See\" is a song by American heavy metal band Five Finger Death Punch. The song was released as the first single from their second album \"War Is the Answer\", and their fourth single overall. The single was released on July 21, 2009.\nIt is their fourth-highest charted single to date, peaking at number eight on the Hot Mainstream Rock Tracks chart. It is the band's third top 10 single. It also reached number 28 on the \"Billboard\n\nDocument (Title: Kieren Webster): Kieren Webster\nKieren Clark Webster, (born 10 May 1986) is the bass guitarist and occasional lead vocalist for Scottish band The View. Along with frontman Kyle Falconer, he writes the majority of The View's material. In 2006, he was placed 6th in NME's Cool List. He and Falconer alternate roles on some songs such as \"Skag Trendy\", \"Gran's for Tea\", \"One Off Pretender\", \"Realisation\", \"Fireworks and Flowers\", \"Hole In The Bed\"\n\nQuestion: The View from the Bottom is the fifth studio album by an American rock band best known for what hit song?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Which was released first, Kolejka or Ghettopoly?",
    "ground_truth": [
      "Ghettopoly"
    ],
    "streamingllm_pred": "Kolejka was released first, in 2011. Ghettopoly was released in",
    "baseline_pred": "Ghettopoly",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Mandrilland): Mandrilland\nMandrilland is the fifth album by Brooklyn-based soul/funk band Mandrill..\nReception.\nReleased in 1974 as a double album, \"Mandrilland\" was the band's last album on Polydor before they moved on to United Artists Records the following year.\nTrack listing.\nAll songs written and arranged by Mandrill\n1. \"Positive Thing\" 3:25\n2. \"Positive Thing +\" 5:15\n3. \"Skying Upward\" 3:45\n4. \"The Road to Love\" 5:15\n\nDocument (Title: Mandrill (band)): Mandrill (band)\nMandrill was an American funk band from Brooklyn, New York, formed in 1968 by brothers Carlos, Lou, and Ric Wilson. AllMusic called them \"One of funk's most progressive outfits... [with an] expansive, eclectic vision.\"\nHistory.\nThe Wilson brothers were born in Panama and grew up in the Bedford–Stuyvesant area of Brooklyn. With Carlos on trombone and vocals, Lou on trumpet and vocals, and Ric on saxophone and vocals, they formed the band to\n\nDocument (Title: Brooklyn): Brooklyn\nBrooklyn () is the most populous borough of New York City, with an estimated 2,648,771 residents in 2017. Named after the Dutch village of Breukelen, it borders the borough of Queens at the western end of Long Island. Brooklyn has several bridge and tunnel connections to the borough of Manhattan across the East River, and the Verrazzano-Narrows Bridge connects it with Staten Island. Since 1896, Brooklyn has been coterminous with Kings County, the most populous county in the U.S. state of New York and the second-\n\nQuestion: What New York State county are soul/funk band Mandril based in?\nAnswer: Kings County\n\nDocument (Title: Robert Clark): Robert Clark\nRobert, Bob or Bobby Clark may refer to:\nTelevision and film.\n- Robert Clark (actor) (born 1987), American-born Canadian television actor\n- Bob Clark (1939–2007), Canadian filmmaker\n- Bob Clark (television reporter), retired American television reporter for <skip>  Warsaw Pact countries like Hungary and Romania.\nHe was caught on tape in October 1990 talking to an assistant who was actually an undercover KOS operative. At the time, war in Croatia hasn't started yet.\nIn the conversations, Špegelj talks of arming Croatians in preparation for secession of Croatia and the impending civil war.\nThe so-called Špegelj tapes were turned into a documentary film by Zastava military film center, and aired in January 1991 to the larger Yugoslav\n\nDocument (Title: Riblja Čorba): Inspektor Blaža i Kljunovi, Zaklonišče Prepeva, Sick Mother Fakers, Six Pack, Alogia, Bjesovi, Del Arno Band and others. Riblja Čorba remains one of the top mainstream acts on the Serbian rock scene, however, Bora Đorđević's support for Serbian nationalism during Yugoslav wars has caused a large decline in the band's popularity, especially in Croatia and Bosnia and Herzegovina.\nThe book \"\" (\"YU 100: The Best albums of Yugoslav pop and rock music\"), published in 1998, features eight Riblja\n\nDocument (Title: Kolejka (game)):.\nReception.\nBy July 2012 the game has sold 20,000 copies of the Polish edition within a year and has been described as best selling. By June 2014, the total production run of the game was almost 100,000 copies. It has also proven popular abroad. In the summer of 2014, IPN sold the game's license to a private company (Trefl), citing its inability to efficiently manage the game's production, demand for which regularly exceeded IPN's production budget, and led—ironically, as numerous\n\nDocument (Title: Verbalni delikt): Ne prepuštam se\n17. J.P.K.P.\n18. U trenutku istine\n19. Užarena masa (skit)\n20. Znam\n21. Zaustavimo nasilje\n22. Mene boli kurac (Remix) (feat. Zelenko)\n23. Ne Spominjem Rat (Hidden Track)\nSources.\n- Možda je sada pravo vrijeme da se bude ljut\n\nQuestion: Which was released first, Kolejka or Ghettopoly?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.18181818181818182,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Who was born first, Steve Hogarth or Donnie Munro?",
    "ground_truth": [
      "Donnie Munro"
    ],
    "streamingllm_pred": "Donnie Munro was born first, on August 2, 1953, while Steve Hog",
    "baseline_pred": "Donnie Munro",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Frank Serpico): Frank Serpico\nFrancesco Vincent Serpico (born April 14, 1936) is a former New York City Police Department (NYPD) officer who holds both American and Italian citizenship. He is known for whistleblowing on police corruption in the late 1960s and early 1970s, an act that prompted Mayor John V. Lindsay to appoint the landmark Knapp Commission to investigate the NYPD. Much of Serpico's fame came after the release of the 1973 film \"Serpico\", which was based on the book by Peter Maas and which starred Al Pacino in\n\nDocument (Title: Knapp Commission): Knapp Commission\nThe Commission to Investigate Alleged Police Corruption (known informally as the Knapp Commission, after its chairman Whitman Knapp) was a five-member panel initially formed in April 1970 by Mayor John V. Lindsay to investigate corruption within the New York City Police Department. The creation of the commission was largely a result of the publicity generated by the public revelations of police corruption made by Patrolman Frank Serpico and Sergeant David Durk. The commission confirmed the existence of widespread corruption and made a number of recommendations.\nMembers.\n\nDocument (Title: Knapp Commission): Knapp Commission\nThe Commission to Investigate Alleged Police Corruption (known informally as the Knapp Commission, after its chairman Whitman Knapp) was a five-member panel initially formed in April 1970 by Mayor John V. Lindsay to investigate corruption within the New York City Police Department. The creation of the commission was largely a result of the publicity generated by the public revelations of police corruption made by Patrolman Frank Serpico and Sergeant David Durk. The commission confirmed the existence of widespread corruption and made a number of recommendations.\nMembers.\n\nQuestion: The Commission to Investigate Alleged Police Corruption (known informally as the Knapp Commission) became informed of Frank Serpico's police corruption by him doing what?\nAnswer: whistleblowing\n\nDocument (Title: Henry Schichtle): Henry Schichtle\nHenry \"Hank\" Ernest Schichtle (born October 13, 1941) is a former American football quarterback who played one season with the New York Giants of the National Football League. He was <skip> 1980, he was drummer for the Scottish pop rock group The Marmalade and performed on their 1978 album \"Doing It All For You\". He then directed his artistic talents towards photography and has continued in this field ever since.\nPhotography.\nWilliamson specialises in monochrome photography\n\nDocument (Title: Steve Stewart): \n\nDocument (Title: Mark MacTaggart-Stewart):, 1990,\n\nDocument (Title: Steven McWhirter): Steven McWhirter\nSteven McWhirter is a pipe band drummer from Northern Ireland. He has won multiple World Championship titles as a solo performer and as part of band. He is the lead drummer for the Inveraray & District Pipe Band.\nLife.\nMcWhirter was born in Ballymena, Northern Ireland, in 1983.\nCareer.\nCareer Band career.\nHe joined the Cullybackey Pipe Band in Northern Ireland in 1994, and also played with the Warrnambool & District Pipe Band in Australia. When he joined Cullybackey he played the\n\nDocument (Title: Steve Hogarth): Hogarth (lead vocals)\n- 2018: \"A Life in Yes: The Chris Squire Tribute\" - Steve Hogarth & Larry Fast (vocals on \"Hold Out Your Hand\")\n- 2018: \"Gleb Kolyadin\" - Gleb Kolyadin (vocals and writing credits on \"Confluence\" and \"The Best of Days\")\n- 2019: \"Reimagines the Eighties\" - Trevor Horn featuring the Sarm Orchestra and Steve Hogarth (vocals on \"It's Different for Girls\")\nExternal links.\n-\n\nDocument (Title: Steve Munro): lights.\n\nDocument (Title: Walt Flanagan): the podcast, “Tell ‘Em Steve-Dave!” submitted entries for music to the song. Courage My Love’s version was chosen as the winner.\nCareer Music video.\n- Soul Asylum - Cant Even Tell (1994) playing hockey on the Quick Stop roof.\nPersonal life.\nFlanagan is married to Debra Flanagan and has two daughters. Kevin Smith recently said on his podcast, SModcast, that Flanagan's family home sustained \"catastrophic\" damage as a result of Hurricane Sandy.\nFlanagan\n\nDocument (Title: Steve Dunn): \n\nQuestion: Who was born first, Steve Hogarth or Donnie Munro?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.2857142857142857,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Are both The Straight Story and Frozen films of the same genre?",
    "ground_truth": [
      "no"
    ],
    "streamingllm_pred": "No, The Straight Story is a drama film, while Frozen is an animated musical fantasy film.",
    "baseline_pred": "No",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Tower Block (film)): Tower Block (film)\nTower Block is a British thriller film directed by James Nunn and Ronnie Thompson at their directorial debut, and written by James Moran. The film stars Sheridan Smith, Jack O'Connell, Ralph Brown, and Russell Tovey and entails residents of a block of flats targeted by an unseen sniper after witnessing the murder of a teenager. \"Tower Block\" was theatrically released in the United Kingdom on 21 September 2012 and was also the closing film at the 2012 FrightFest Film Festival.\nPlot.\nOne\n\nDocument (Title: Tower Block (film)): - Ralph Brown as Neville\n- Russell Tovey as Paul\n- Jill Baker as Violet\n- Loui Batley as Amy\n- Steven Cree as DC Devlin\n- Nabil Elouahabi as Gary\n- Christopher Fulford as Kevin\n- Julie Graham as Carol\n- Tony Jayawardena as Eddie\n- Jamie Thomas King as Ryan\n- Ralph Laurila as Jimmy\n- Michael Legge as Jeff\n- Montserrat Lombard as Jenny\n- Jordan Long as Ormond\n- Harry McEntire as Daniel\n- Kane Robinson as Mark\n-\n\nDocument (Title: Russell Tovey): also starred as Harry Doyle in the drama-thriller series \"Quantico\" on the ABC network. In addition, he also stars as Ray Terrill/The Ray in the Arrowverse.\nEarly life.\nTovey is the younger of two children, born to Carole Haynes (formerly Webb) and George Tovey, who run a Romford-based coach service taking passengers from Essex to Gatwick Airport. Tovey has an older brother, Daniel. He grew up in Billericay, Essex, and he attended Harold Court School in Harold\n\nQuestion: What is the name of the character in Quantico played by the same actor who starred in Tower Block?\nAnswer: Harry Doyle\n\nDocument (Title: Max Abramson): Max Abramson\nAlbert \"Max\" Abramson (born April 29, 1976) is an American politician currently serving as a Libertarian member of the New Hampshire House of Representatives, representing Rockingham District 20 (Hampton Falls, Seabrook).\nCareer.\nIn 2010, Abramson <skip>  around the same time. The two studios were \"scrambling to mine every potential dollar from their\n\nDocument (Title: List of LGBT-related films): 2001)\n- \"Stiff Upper Lips\", UK (1998)\n- \"Stonewall\", UK (1995)\n- \"Stonewall\", US (2015)\n- \"Stonewall Uprising\", US (2010)\n- \"Story of a Bad Boy\", US (1999)\n- \"The Story of Piera\" (Storia di Piera), Italy (1983)\n- \"Straight\", Germany (2007)\n- \"Straight for the Heart\" (À corps perdu)\n\nDocument (Title: Walt Disney Pictures): \"Beauty and the Beast\" (2017), and \"Aladdin\" (2019); and has released six animated films that have reached that milestone: \"Toy Story 3\" (2010), \"Frozen\" (2013), \"Zootopia\", \"Finding Dory\" (both 2016), \"Incredibles 2\" (2018), \"The Lion King\" and \"Aladdin\" (both 2019).\n—Includes theatrical reissue(s).\nSee also.\n- Walt Disney Studios (division)\n\nDocument (Title: Emily Bett Rickards): Emma/The Princess, but was initially concerned she looked too young for the role of \"rundown, blue collar, life’s been beaten out of her, mother\". However, following consultation with make-up artist Tina Teoli, he was convinced that they could age her appropriately for the role.\nIn 2017 she starred alongside Jana Winternitz and Matthew Glave in the Michael Gallagher directed comedy film \"Funny Story\". filmed over fifteen days in Los Angeles, and on location at Topanga Canyon and Big Sur.\n\nDocument (Title: Toy Story): competing for the affections of their owner Andy Davis, to friends who work together to be reunited with him after being separated.\nFollowing the success of Pixar's 1988 short film \"Tin Toy\", the company was approached by Disney to produce a computer-animated feature film, told from a small toy's perspective. Lasseter, Stanton, and Docter wrote early story treatments, which were rejected by Disney, who wanted the film's tone to be \"edgier\". After several disastrous story reels, production was halted\n\nQuestion: Are both The Straight Story and Frozen films of the same genre?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "KSCW-DT is part of a duopoly with which virtual channel 12 in Wichita?",
    "ground_truth": [
      "KWCH-DT"
    ],
    "streamingllm_pred": "KWCH-DT. KSCW-DT is part of a duopoly with KWCH-D",
    "baseline_pred": "KWCH-DT",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Lois Weber): 1901 in Manhattan. He appeared in productions of Harrison Grey Fiske, Minnie Maddern Fiske, and Raymond Hitchcock. After a brief acquaintance, just before her 25th birthday, Weber and Smalley, aged 38, married on April 29, 1904 in Chicago, Illinois.\nAfter initially touring separately from her husband, and then accompanying him on his tours, about 1906 Weber left her career in the theater and became a homemaker in New York. During this period Weber wrote freelance moving picture scenarios.\nFilm career.\nIn\n\nDocument (Title: Charles Band): Charles Band\nCharles Robert Band (born December 27, 1951) is an American film producer and director, known for his work on horror comedy movies.\nHis most famous films are those in the \"Puppet Master\" franchise and the \"Subspecies\" series, made by his company Full Moon Features. Before Full Moon Features, his earlier (and now defunct) company Empire Pictures made films like \"Ghoulies\" and the cult classic \"Re-Animator\". One of the few non-horror films he worked\n\nDocument (Title: Lois Weber): Lois Weber\nLois Weber (June 13, 1879 – November 13, 1939) was an American silent film actress, screenwriter, producer, and director. She is identified in some historical references as \"the most important female director the American film industry has known\", and among “the most important and prolific film directors in the era of silent films\". Film historian Anthony Slide has also asserted, \"Along with D. W. Griffith, Weber was the American cinema's first genuine auteur, a filmmaker involved in all\n\nQuestion: Lois Weber and Charles Band were both involved in which entertainment medium?\nAnswer: film\n\nDocument (Title: Royal Danish Navy): Royal Danish Navy\nThe Royal Danish Navy () is the sea-based branch of the Danish Defence force. The RDN is mainly responsible for maritime defence and maintaining the sovereignty of Danish, Greenlandic and Faroese territorial waters. Other tasks include surveillance, search and rescue, icebreaking, oil spill recovery and prevention as well as contributions to international tasks and forces.\nDuring the period 1509–1814, when Denmark was in a union with <skip> -digital conversion.\nKSTW shut down\n\nDocument (Title: KSNW): Now 22, which is carried locally on Cox Communications, from Gray Television (owners of KAKE, and WIBW-TV in Topeka) to produce its own news and weather content for the channel and provide rebroadcasts of its local newscasts.\nOn October 31, 2010, KSNW began broadcasting its local newscasts in widescreen standard definition; in-studio, field and other station camera feeds were upconverted to a format in the control room. On January 30, 2011, KSNW began broadcasting the weather segments of its newscasts in high\n\nDocument (Title: KWCH-DT): in northeast Wichita; KWCH and KSCW share transmitter facilities in rural northeastern Reno County (south-southeast of Buhler).\nKWCH serves as the flagship of the Kansas Broadcasting System (KBS), a statewide network of four full-power stations that relay CBS network and other programming provided by KWCH across central and western Kansas, as well as bordering counties in Colorado, Nebraska and Oklahoma.\nHistory.\nThe station first signed on the air on July 1, 1953 as KTVH. It is the oldest surviving television\n\nDocument (Title: LIN Media): stations:\n- KNIN-TV 9 Boise, Idaho (formerly UPN) (now a Fox affiliate owned by Gray Television and operated by the E. W. Scripps Company; was affiliated with The CW from 2006 to 2011)\n- KWCV 33 Wichita, Kansas (formerly WB) (now The CW affiliate KSCW-DT owned by Gray Television)\n\nDocument (Title: KCWE): intersection of East 23rd Street and Topping Avenue in the city's Blue Valley section. On cable, KCWE is available on Comcast Xfinity channel 2 in Missouri and channel 13 in Kansas, Charter Spectrum channel 7, Consolidated Communications channel 16, and Google Fiber and AT&T U-verse channel 29. There is a high definition feed provided on Spectrum digital channel 1212, Xfinity channel 802, Consolidated channel 615 and U-verse channel 1029.\nKCWE also serves as an alternate CW affiliate for the St. Joseph market (which borders\n\nQuestion: KSCW-DT is part of a duopoly with which virtual channel 12 in Wichita?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.2222222222222222,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "The Panel with striding lion  was one of many that lined the way north of the gate to the inner city of what location?",
    "ground_truth": [
      "Babylon"
    ],
    "streamingllm_pred": "Babylon, Iraq. The Panel with striding lion is one of many such reliefs that decorated the",
    "baseline_pred": "Babylon",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Operation Grapple): Operation Grapple\nOperation Grapple was the name of four series of British nuclear weapons tests of early atomic bombs and hydrogen bombs carried out in 1957 and 1958 at Malden Island and Kiritimati (Christmas Island) in the Pacific Ocean as part of the British hydrogen bomb programme. Nine nuclear explosions were initiated, culminating in the United Kingdom becoming the third recognised possessor of thermonuclear weapons, and the restoration of the nuclear Special Relationship with the United States with the 1958 US-UK Mutual Defence Agreement.\nDuring the Second World War,\n\nDocument (Title: Operation Grapple): had been granted permission by the United States and British governments to operate a flying boat service from Christmas Island. Patrick Dean asked the British Ambassador to the United States, Sir Roger Makins to sound out the US government about terminating the contract. Makins reported in March 1956 that Admiral Arthur W. Radford, the Chairman of the Joint Chiefs of Staff, was willing to help so long as the dormant American claim to the island was not prejudiced. The lease on the island facilities, including the airfield and the port, had been\n\nDocument (Title: Special Relationship): Special Relationship\nThe Special Relationship is an unofficial term often used to describe the political, diplomatic, cultural, economic, military, and historical relations between the United Kingdom and the United States. The term first came into popular usage after it was used in a 1946 speech by Winston Churchill. The two nations have been close allies during many conflicts in the 20th and 21st centuries, including World War I, World War II, the Korean War, the Cold War, the Gulf War, and the War on Terror.\n\nQuestion: Operation Grapple helped fix something with the United States, which was used by which notable person in a speech?\nAnswer: Winston Churchill\n\nDocument (Title: Moonbabies (band)): Moonbabies (band)\nMoonbabies is a Swedish duo formed in 1997 by vocalists, multi-instrumentalists, producers, and songwriters Ola Frick (Vocals, guitar and various instruments) and Carina Johansson (Vocals and keyboards).\nHistory.\nTheir earliest efforts recalled early Indie/Shoegazer influences by bands like My Bloody Valentine <skip>  name Leo\nIn fine art.\nIn fine art Paintings of lions.\nIn fine art Paintings of lions U.K..\n- Nelson's Column (1843) in Trafalgar Square, London, UK, four lions sculpted by William Railton\nIn fine art Paintings of lions U.S..\n- National Zoological Park, two 5,000 pound, reclining brass lions flank the Connecticut Avenue entrance,\n- \"Patience and Fortitude\", the two Tennessee marble lions flanking the main entrance to the Stephen A. Schwarzman Building, the New\n\nDocument (Title: Lion Gate): On the top of the pillar is a row of four discs, apparently representing rafters supporting a further piece of sculpture that has since been lost. Another view is as follows: above the head of the column and what is probably a slab supporting an architrave is a row of discs (ends of transverse beams) and another slab the same size as the slab on top of the column. The beams and the block above them represent a more extended superstructure shortened here because of the diminishing space in the triangle. Thus,\n\nDocument (Title: The Queen's Beasts): wall of the annex and the entrance used by the Queen to enter the Abbey on her arrival in the Gold State Coach. The statues were placed left to right in the following order when facing the annex from the west: The Lion of England, the greyhound, the yale, the dragon, the horse, the lion of Mortimer, the unicorn, the griffin, the bull, and the falcon. This was not the same order as they are in the royal pedigree, but were ordered in this way for balance\n\nDocument (Title: Coade stone): to make way for the South Bank Site of the 1951 Festival of Britain, the Lion was taken down and moved to Station Approach Waterloo, painted red as the symbol of British Rail on high plinth. When removed, the initials of the sculptor William F. Woodington and the date, 24 May 1837, were discovered under one of its paws. The fine details still remain clear after 170 years of London's corrosive atmosphere, caused by heavy use of coal throughout the 19th and first half of the 20th centuries. The red\n\nQuestion: The Panel with striding lion  was one of many that lined the way north of the gate to the inner city of what location?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.13333333333333333,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "What movie did Chris Duesterdiek work on that was directed by Seth Rogen and Evan Goldberg?",
    "ground_truth": [
      "The Interview"
    ],
    "streamingllm_pred": "Not specified in the documents. However, Chris Duesterdiek worked on several projects, including \"",
    "baseline_pred": "The Interview",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Bally Sagoo): Bally Sagoo\nBaljit Singh \"Bally\" Sagoo (born 19 May 1964) is a British-Indian record producer. Born in Delhi, India, Sagoo was raised in Birmingham, England. He entered the recording and entertainment industries in 1989. He remains a force in the music industry and is the figurehead of the UK/Belgium based entertainment company, Fresh Dope Industries.\nEarly life.\nSagoo grew up in the Balsall Heath area of Birmingham. In the 1970s, his father Saminder Sagoo ran his own retail\n\nDocument (Title: Rising from the East): Rising from the East\nRising From The East is an album by a UK based Indian DJ Bally Sagoo in 1996.\n\nDocument (Title: Rising from the East): Rising from the East\nRising From The East is an album by a UK based Indian DJ Bally Sagoo in 1996.\n\nQuestion: What is the birthplace for the DJ who released the album Rising from the East?\nAnswer: Delhi, India\n\nDocument (Title: Cadbury): Cadbury\nCadbury, formerly Cadbury's and Cadbury Schweppes, is a British multinational confectionery company wholly owned by Mondelez International (originally Kraft Foods) since 2010. It is the second largest confectionery brand in the world after Mars. Cadbury is internationally headquartered in Uxbridge, west London, and operates in more than 50 countries worldwide. It is known for its Dairy Milk chocolate, the Creme Egg and Roses selection box, and many other confectionery products. One of the best-known British brands, in 2013 \"The Daily Telegraph\n\nDocument (Title: La Pie qui Chante): La Pie qui Chante\nLa Pie qui Chante (\"English: The Singing Magpie\"), is a French brand of confectionery, since 2017 owned by Eurazeo.\nHistory.\nIn 1860, Emile Cornillot started creating handmade confectionery from premises on rue Colbert, Lille, specializing in bonbons. The quality of the sweets meant that in 1885, he moved to larger premises on rue de l'Hôpital militaire.\nAfter <skip>  \"Think Tank\"), as well\n\nDocument (Title: ModeHuman): ModeHuman\nmodeHuman is the debut studio album by Brazilian rock band Far from Alaska, released on May 13, 2014 in Brazil. The album was recorded at the Tambor studio in Rio de Janeiro and produced by Pedro Garcia, former drummer of the rap rock musical group Planet Hemp. It was mastered in Seattle by Chris Hanzsek, who has previously worked with Soundgarden, Melvins and Skin Yard.\nConcept and composing.\nAccording to the cover art creator Alexandre Wake, the album \"works with the concept of robotics through\n\nDocument (Title: Reed Van Dyk): -writer, director, producer)\n- 2008: \"The Conservatory\" (Short) (writer, director, producer)\n- TBA: \"Placid Universe Theory\"' (Short) (grip) (post-production)\n- 2016: \"Owen\"' (Short) (grip)\n- 2015: \"Christian Fellowship Players\"' (Short) (grip)\n- 2015: \"F.T.E.W: For The Epic Win\"' (Short) (gaffer)\nExternal links.\n\nDocument (Title: Bob Degus): Bob Degus\nBob Degus is an American film director and producer. He is best known for producing such film as \"Pleasantville\" and \"A Man Apart\". His directorial debut was with the film \"9/Tenths\" in 2006.\nBiography.\nProducer of two Academy Award-nominated short films, two-time CableACE Award nominee and a Satellite Awards Nominee, Bob Degus started from the ground up and has, at one point or another, done almost every job in filmmaking; including writer, director\n\nDocument (Title: Larry Fessenden): of the Metropolitan Museum Of Modern Art. He has also directed the television feature \"Beneath\" (2013), an episode of the NBC TV series \"Fear Itself\" (2008) entitled \"Skin and Bones\", and a segment of the anthology horror-comedy film \"The ABCs of Death 2\" (2014). He is the writer, with Graham Reznick, of the BAFTA Award-winning Sony Playstation video game \"Until Dawn\". He has acted in numerous films including \"Like Me\" (\n\nQuestion: What movie did Chris Duesterdiek work on that was directed by Seth Rogen and Evan Goldberg?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  },
  {
    "question": " The Canadian Hot 100 is a music industry record chart in Canada for for a song that is released separately from what?",
    "ground_truth": [
      "an album"
    ],
    "streamingllm_pred": "an album.  The Canadian Hot 100 is a music industry record chart in Canada for songs",
    "baseline_pred": "an album",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Barstow Mall): Barstow Mall\nBarstow Mall is a shopping mall in Barstow, California. It opened in 1975 with two anchor stores: Sears and Kmart. The Kmart store was originally slated to be W. T. Grant, which withdrew from the mall plans due to the chain's filing for bankruptcy. This resulted in the mall being only the second in the country to have both a Kmart and a Sears in it. Ernest Hahn was the mall's developer.\nKmart moved outside the mall in the early 1990s and its building was never\n\nDocument (Title: Barstow Mall): Barstow Mall\nBarstow Mall is a shopping mall in Barstow, California. It opened in 1975 with two anchor stores: Sears and Kmart. The Kmart store was originally slated to be W. T. Grant, which withdrew from the mall plans due to the chain's filing for bankruptcy. This resulted in the mall being only the second in the country to have both a Kmart and a Sears in it. Ernest Hahn was the mall's developer.\nKmart moved outside the mall in the early 1990s and its building was never\n\nDocument (Title: Kmart): Kmart\nKmart Corporation (, doing business as Kmart and stylized as kmart) is an American big box department store chain headquartered in Hoffman Estates, Illinois, United States.\nThe company was incorporated in 1899 as S. S. Kresge Corporation and renamed to Kmart Corporation in 1977. The first store with the Kmart name opened in 1962. At its peak in 1994, Kmart operated 2,323 discount stores and Super Kmart Center locations in the United States. After declaring bankruptcy in 2002 and again in 2018, the chain's store count\n\nQuestion: Barstow Mall opened in 1975 with which big box department store chain heaquartered in Illinois as one of its stores?\nAnswer: Kmart\n\nDocument (Title: Thomas Nash): Thomas Nash\nThomas Nash (baptised 20 June 1593 – died 4 April 1647) was the first husband of William Shakespeare's granddaughter Elizabeth Barnard. He lived most of <skip>  one and \"I Gotta Feeling\" at number two.\n- On the issue dated October 24, 2009, \"3\" by Britney Spears broke the record for the biggest jump to number one, leaping from number 86 to number one.\n- \"Counting Stars\" by OneRepublic had the longest climb to number one taking 34 weeks to reach that peak.\n- On the issue dated October 31, 2015, The Weeknd's \"The Hills\" reached the top spot seven weeks after \"Ca\n\nDocument (Title: Shake It Off): after debuting at number one; it is her third song to do so, tying her with Eminem and Katy Perry for the most songs to debut at number one on the chart. By the year's end, it had sold 341,000 copies in Canada.\nThe song had also seen success in Europe. In the United Kingdom, \"Shake It Off\" became Swift's sixth top 10 when the song debuted at number four on August 30, 2014. After nine weeks on the chart, \"Shake It Off\"\n\nDocument (Title: List of Canadian Hot 100 top 10 singles in 2014): 2017.\nTop-Ten singles.\n- Key\n- – indicates single's top 10 entry was also its Canadian Hot 100 debut\nNotes.\nThe single re-entered the top ten on the week ending January 11, 2014.\nThe single re-entered the top ten on the week ending January 18, 2014.\nThe single re-entered the top ten on the week ending January 25, 2014.\nThe single re-entered the top ten on the week ending February 1,\n\nDocument (Title: Bigger (Justin Bieber song)): than chasing skirt.\"\nReception Chart performance.\nOn the week ending December 5, 2009, due to digital sales after the release of \"My World\", \"Bigger\" debuted on the US \"Billboard\" Hot 100 and the Canadian Hot 100. The song debuted at number forty-nine on the Hot Digital Songs chart in the US, and therefore consecutively appeared at number ninety-four on the Hot 100. In Canada, it debuted at number seventy-eight. It dropped off both charts the following\n\nQuestion:  The Canadian Hot 100 is a music industry record chart in Canada for for a song that is released separately from what?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.14285714285714288,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "The Italian surname Bellini is normally written after what names?",
    "ground_truth": [
      "given names"
    ],
    "streamingllm_pred": "The Italian surname Bellini is normally written after names. In Italian, it is common for the surname",
    "baseline_pred": "given names",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Purshia): Purshia\nPurshia (bitterbrush or cliff-rose) is a small genus of 5-8 species of flowering plants in the family Rosaceae, native to western North America, where they grow in dry climates from southeast British Columbia in Canada south throughout the western United States to northern Mexico. The classification of \"Purshia\" within the Rosaceae has been unclear. The genus was originally placed in the subfamily Rosoideae, but is now placed in subfamily Dryadoideae.\nThey are deciduous or evergreen shrubs, typically reaching 0.3–5 m tall.\n\nDocument (Title: Purshia): Purshia\nPurshia (bitterbrush or cliff-rose) is a small genus of 5-8 species of flowering plants in the family Rosaceae, native to western North America, where they grow in dry climates from southeast British Columbia in Canada south throughout the western United States to northern Mexico. The classification of \"Purshia\" within the Rosaceae has been unclear. The genus was originally placed in the subfamily Rosoideae, but is now placed in subfamily Dryadoideae.\nThey are deciduous or evergreen shrubs, typically reaching 0.3–5 m tall.\n\nDocument (Title: Bulbinella): Bulbinella\nBulbinella is a genus of plant in the family Asphodelaceae, subfamily Asphodeloideae, first described as a genus in 1843. Many species are endemic to Cape Province in western South Africa, confined to the winter rainfall area. Other species are endemic to New Zealand, where they are most common in the central Otago region which enjoys a similar climate to the Cape Region of South Africa.\nDescription.\nThey are characterised by the presence of a dense terminal raceme of flowers, often yellow but also white, pink,\n\nQuestion: Which genus is native to western North America, Purshia or Bulbinella?\nAnswer: Purshia\n\nDocument (Title: Choteau, Montana): Choteau, Montana\nChoteau is a city in and the county seat of Teton County, Montana, United States. It lies along U.S. Routes 89 and  <skip> 1750–1788), Jesuit scholar\n- Gasparo Angiolini (1731–1803), Italian dancer and choreographer and composer\n- Sandro Angiolini (1920–1985), Italian comics creator\n\nDocument (Title: Michelini): Michelini\nMichelini is an Italian surname. Notable people with the surname include:\n- Arturo Michelini (1909–1969), Italian politician\n- Costanza Michelini (born 1997), Italian trampolinist\n- Danilo Michelini (1917-1983), Italian footballer\n- Famiano Michelini (1604–1665), Italian mathematician\n- Flavien Michelini (born 1986), French footballer\n- Giovanni Battista Michelini (1604–1655), Italian painter\n- Giulia Michelini (born 1985), Italian actress\n- Ottavio Michelini (1906-1979)\n\nDocument (Title: Battistini): Battistini\nBattistini is an Italian surname. Notable people with the surname include:\n- Alfredo Battistini (1953–2008), Italian-Swiss sculptor, illustrator and athlete\n- Dillon Battistini (born 1977), English racing driver\n- Graziano Battistini (1936–1994), Italian cyclist\n- Graziano Battistini (footballer), (born 1970), retired Italian football goalkeeper\n- Manuel Battistini (born 1994), Sammarinese footballer\n- Mattia Battistini (1856–1928), Italian opera singer\n- Sergio Battistini (born 1963)\n\nDocument (Title: Albertini): Albertini\nAlbertini is an Italian surname. Notable people with the surname include:\n- Demetrio Albertini (born 1971), Italian football (soccer) midfielder\n- Ellen Albertini Dow (1913-2015), American actress\n- Francesco Albertini (died 1510), Italian priest and author\n- Gabriele Albertini (born 1950), former mayor of Milano and Member of the European Parliament\n- Ignazio Albertini (1644–1685), Italian Baroque musician and composer\n- Joachim Albertini (1748–1812), Polish-Italian composer\n\nQuestion: The Italian surname Bellini is normally written after what names?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.11764705882352941,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "What is the nickname of this American retired airline captain celebrated for his water landing with Jeffrey Skiles, after a bird strike and being unable to reach an airport?",
    "ground_truth": [
      "Sully"
    ],
    "streamingllm_pred": "Sully.  Chesley Sullenberger is also known as \"Sully\".  He is",
    "baseline_pred": "Sully",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Wish Way): Wish Way\nA Wish Way is a device that appears in three of the Oz books of Ruth Plumly Thompson, \"The Royal Book of Oz\", \"The Hungry Tiger of Oz\", and \"The Lost King of Oz\". Two Wish Ways are found in distinctly different locations, both in the Winkie Country.\nThe dust of the road is able to grant any wishes. In \"The Royal Book of Oz\", Dorothy Gale wishes the Scarecrow back in her presence.\nBetsy Bobbin encounters a\n\nDocument (Title: The Lost King of Oz): The Lost King of Oz\nThe Lost King of Oz (1925) is the nineteenth in the series of Oz books created by L. Frank Baum and his successors, and the fifth written by Ruth Plumly Thompson. It was Illustrated by John R. Neill.\nThompson's approach.\nAs she sometimes does in her books, Thompson exploits a detail in Baum's work to generate her story. Baum mentions Pastoria, Ozma's father and former ruler of Oz, only briefly in the twentieth chapter of \"The Marvelous Land\n\nDocument (Title: Wish Way): Wish Way\nA Wish Way is a device that appears in three of the Oz books of Ruth Plumly Thompson, \"The Royal Book of Oz\", \"The Hungry Tiger of Oz\", and \"The Lost King of Oz\". Two Wish Ways are found in distinctly different locations, both in the Winkie Country.\nThe dust of the road is able to grant any wishes. In \"The Royal Book of Oz\", Dorothy Gale wishes the Scarecrow back in her presence.\nBetsy Bobbin encounters a\n\nQuestion: A Wish Way is a device that appears in a book illustrated by who?\nAnswer: John R. Neill\n\nDocument (Title: Michelle Mitchenor): Michelle Mitchenor\nMichelle Mitchenor (born April 21, 1988) is an American actress. She is known for portraying the series regular role of Detective Sonya Bailey on the FOX's primetime action comedy-drama television series \"Lethal Weapon\" and the role of Indigo in the musical-drama film \"Chi-Raq\".\nEarly years.\nMitchenor attended Ocean County Performing Arts Academy High School in New Jersey to study dancing and acting. Mitchenor <skip> -54 pilot.\n- 19 December 1964 – USAF KC-97G \"52-907\" ran off the runway at Ernest Harmon AFB after the pilot landed too far down the runway, killing all five on board. The pilot attempted to abort the landing, but the aircraft struck approach lights and crashed into a pond.\n- 19 January 1969 – Wisconsin Air National\n\nDocument (Title: Chesley Sullenberger): Chesley Sullenberger\nChesley Burnett \"Sully\" Sullenberger III (born January 23, 1951) is an American retired airline captain who, on January 15, 2009, landed US Airways Flight 1549 in the Hudson River off Manhattan after both engines were disabled by a bird strike; all 155 people aboard survived. Sullenberger is a speaker on airline safety and has helped develop new protocols for airline safety. He served as the co-chairman, along with First officer Jeffrey Skiles, of the EAA's Young Eagles youth introduction-to\n\nDocument (Title: Pegasus Field): a 4-inch layer of compacted snow on top—thus more properly characterizing it as a white ice runway.\nThe field is named after \"Pegasus\", a C-121 Lockheed Constellation that made a forced landing on unprepared terrain in bad weather on October 8, 1970. No one on board was injured. The aircraft remains in-situ at the airfield to this day, and has remained well preserved due to the low temperatures of the surrounding area.\nOn September 11, 2008, a United States Air Force C-17 Globemaster\n\nDocument (Title: List of microbursts): Denver Stapleton International Airport. After being alerted by LLWAS of an imminent encounter with a microburst, Captain Craig Levine initiated a missed approach, taking his Boeing 737 to full takeoff power, climbing and adding of airspeed. Encountering the microburst at full takeoff power, they lost of altitude and lost of airspeed in about one-half of a minute. This event is a documented \"save\" of an airplane by a windshear alert system.\n- August 7, 1994 – Severe thunderstorms produce numerous reports of damaging winds (and\n\nQuestion: What is the nickname of this American retired airline captain celebrated for his water landing with Jeffrey Skiles, after a bird strike and being unable to reach an airport?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.18181818181818182,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Who lived longer Ellen Glasgow or N. Scott Momaday ?",
    "ground_truth": [
      "N. Scott Momaday"
    ],
    "streamingllm_pred": "N. Scott Momaday lived longer than Ellen Glasgow. Ellen Glasgow died on November 21,",
    "baseline_pred": "N. Scott Momaday",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: The Second City): The Second City\nThe Second City is an improvisational comedy enterprise and historically first on-going improvisational theater troupe, continually based in Chicago. It also has training programs and live theatres in Toronto and Los Angeles. The Second City Theatre opened on December 16, 1959, and has since become one of the most influential and prolific comedy theatres in the world.\nThe Second City has produced television programs in both Canada and the United States, including \"SCTV\", (\"SNL\"), \"Second City Presents\n\nDocument (Title: Brian Gallivan): Brian Gallivan\nBrian Gallivan is an American actor, writer and comedian. He gained significant attention for his Second City Network web series \"Sassy Gay Friend\", based on a character he created in 2004 Second City mainstage revue \"Red Scare\". The series shows events that may have transpired if famous women (and a few men) in literature, film and history had been advised by the titular character.\nGallivan got his start improvising in his hometown of Boston before moving to Chicago in 2003, where he performed\n\nDocument (Title: Brian Gallivan): Brian Gallivan\nBrian Gallivan is an American actor, writer and comedian. He gained significant attention for his Second City Network web series \"Sassy Gay Friend\", based on a character he created in 2004 Second City mainstage revue \"Red Scare\". The series shows events that may have transpired if famous women (and a few men) in literature, film and history had been advised by the titular character.\nGallivan got his start improvising in his hometown of Boston before moving to Chicago in 2003, where he performed\n\nQuestion: Brian Gallivan was an actor who created a web series for the network run by the theatre troupe based in what city?\nAnswer: Chicago\n\nDocument (Title: The Cars): The Cars\nThe Cars were an American rock band that emerged from the new wave scene in the late 1970s. The band originated in Boston in 1976, with singer, rhythm guitarist, and songwriter Ric Ocasek; bassist and singer Benjamin Orr; lead guitarist Elliot Easton; keyboardist Greg Hawkes; and drummer David Robinson.\nThe Cars were at the forefront in <skip> ): :\n\"Given what we know about Dawson's activities in the United States during the late 1920s — where she was a highly effective labor organizer, known for her courage on the picket line and her fiery oratory — Red Clydeside must have been Dawson's classroom and the activists of the period her teacher. During these years she was introduced to the realities of industrial wage labor, and began formulating her own attitudes and opinions as a worker. During this time Scottish women emerged not only as rank-and-file workers\n\nDocument (Title: Ellen Goldsmith-Vein): Ellen Goldsmith-Vein\nEllen Goldsmith-Vein (born 1963) is an American television and film producer. She is the founder and CEO of the Gotham Group, a management company. As the only woman to own her own management company, with over 40 employees, Goldsmith-Vein was the first talent manager ever featured on the cover of the “Power 100” special issue of The Hollywood Reporter in 2006.\nEarly life.\nEllen Goldsmith-Vein was born in 1963 in La Jolla, San Diego.\n\nDocument (Title: Ellen Barrett): \n\nDocument (Title: Margaret Scott (author)): Margaret Scott (author)\nMargaret Daphne Scott (20 June 1934 – 29 August 2005) was an Australian author, poet, comedian, educator and public intellectual.\nBackground.\nMargaret, her first husband, playwright Michael Boddy (1934–2014), and her first son, Daniel, migrated to Tasmania from the United Kingdom in 1959. Two more children, Kate and Marcus, were born in Tasmania. From 1979, she lived with legal scholar Michael Scott and had her final child, Sarah, as well as\n\nDocument (Title: Ellen Dawson): woman ever elected to a leadership position in an American textile union.\nBiography.\nBiography Early years.\nEllen Dawson was born on December 14, 1900 in Barrhead, a small industrial town of about 9,000 residents on the outskirts of Glasgow, Scotland. She was the fifth of at least 10 children born to Annie Halford Dawson and Patrick Dawson, a poor working class couple. Her paternal grandparents were indigenous Scots, while her maternal grandparents were Irish emigrants, having left Ireland in the 1840s to escape the Great Famine.\n\nQuestion: Who lived longer Ellen Glasgow or N. Scott Momaday?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.35294117647058826,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Both The Badgeman and +44 were bands concieved in which country?",
    "ground_truth": [
      "United Kingdom"
    ],
    "streamingllm_pred": "United Kingdom.  +44 refers to the international dialing code of the United Kingdom. The Bad",
    "baseline_pred": "United Kingdom",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Thornton Wilder): Thornton Wilder\nThornton Niven Wilder (April 17, 1897 – December 7, 1975) was an American playwright and novelist. He won three Pulitzer Prizes—for the novel \"The Bridge of San Luis Rey\", and for the plays \"Our Town\" and \"The Skin of Our Teeth\" — and a U.S. National Book Award for the novel \"The Eighth Day\".\nEarly years.\nWilder was born in Madison, Wisconsin, the son of Amos Parker Wilder, a newspaper editor and U.S. diplomat\n\nDocument (Title: John Hersey): John Hersey\nJohn Richard Hersey (June 17, 1914 – March 24, 1993) was an American writer and journalist. He is considered one of the earliest practitioners of the so-called New Journalism, in which storytelling techniques of fiction are adapted to non-fiction reportage. Hersey's account of the aftermath of the atomic bomb dropped on Hiroshima, Japan, was adjudged the finest piece of American journalism of the 20th century by a 36-member panel associated with New York University's journalism department.\nBackground.\n\nDocument (Title: Thornton Wilder): Thornton Wilder\nThornton Niven Wilder (April 17, 1897 – December 7, 1975) was an American playwright and novelist. He won three Pulitzer Prizes—for the novel \"The Bridge of San Luis Rey\", and for the plays \"Our Town\" and \"The Skin of Our Teeth\" — and a U.S. National Book Award for the novel \"The Eighth Day\".\nEarly years.\nWilder was born in Madison, Wisconsin, the son of Amos Parker Wilder, a newspaper editor and U.S. diplomat\n\nQuestion: John Hersey and Thornton Wilder had the skills to play basketball or write/novel?\nAnswer: writer\n\nDocument (Title: Brandenburg Cup): Brandenburg Cup\nThe Brandenburgischer Landespokal (), known as the Krombacher Pokal Brandenburg for sponsorship reasons, is an annual football cup competition, held by the (). It is one of the 21 regional cup competitions in Germany.\nThe record winners of the competition are SV Babelsberg 03, with seven titles to their name (including <skip> Modern Jesus\". It received favorable reviews from music critics, and charted in the US, Austria, Germany, France and Switzerland.\nPromotion.\nThroughout early\n\nDocument (Title: Heaven & Hell: A Tribute to the Velvet Underground): You\"\n10. The Badgeman - \"Sister Ray\"\n\nDocument (Title: Supernaut (Australian band)): Twenty Flight Rockers with former Generation X drummer Mark Laff, and later played with rock supergroup, the International Swingers. Chris Burnham played in The Saints with Chris Bailey from 1982 and 1989. Philip Foxman formed Illustrated Man in 1984 with Japan member Rob Dean, Gary Numan keyboardist Roger Mason, and Hugo Burnham from Gang of Four. They recorded one self-titled album and toured the UK and US with their single, \"Head Over Heels\", charting the top 20 on MTV's dance charts. Foxman later had\n\nDocument (Title: Stoneman (band)): Stoneman (band)\nStoneman is a band founded in 2004 from various areas of Switzerland. With the release of their fourth album in 2014, the band underwent a change in style from Dark Rock to Neuen Deutsche Härte.\nHistory.\nAfter Mikki Chixx and Rico H decided to form a band in spring 2004, they quickly found some like-minded people. Despite several changing bassists, the original formation of the band Stoneman was clear.\nOn October 20, 2006 the debut album \"Sex Drugs Murder\"\n\nDocument (Title: Michael Nyman Band): mostly comprised pieces written for the early films of Peter Greenaway. This album was not released on compact disc until 2012. Another self-titled album (1995) has appeared as a promotional item compiling tracks from various other albums, and should not be confused with this one.\nAlong with soundtracks to Greenaway's \"The Draughtsman's Contract\", \"Drowning by Numbers\", and \"The Cook The Thief His Wife & Her Lover\", their 1980s output included \"The Kiss and Other Movements\" (which includes\n\nDocument (Title: Badge Man): External links.\n- The Moorman Polaroid Photograph\n- JFK Online: Badge Man\n- JFK Files: Badge Man\n- Mary Moorman's Camera - Polaroid Highlander Model 80A\n\nQuestion: Both The Badgeman and +44 were bands concieved in which country?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0.2857142857142857,
      "baseline_f1": 1.0
    }
  },
  {
    "question": "Who created the series broadcast on the WB that Leigh-Allyn Baker had a recurring role on?",
    "ground_truth": [
      "Constance M. Burge"
    ],
    "streamingllm_pred": "Ryan Murphy and Gina Matthews. Answer: Ryan Murphy and Gina Matthews. Answer: Ryan Murphy and Gina",
    "baseline_pred": "Constance M. Burge",
    "input_text": "<|begin_of_text|>Use the given documents to write a concise and short answer to the question. Write your answer in the following format:\nAnswer: [answer]\n\nDocument (Title: Cars 2): the following year on July 18, 2014.\n\nDocument (Title: Cars 2): Cars 2\nCars 2 is a 2011 American 3D computer-animated action-adventure comedy film produced by Pixar Animation Studios for Walt Disney Pictures. It is the sequel to 2006's \"Cars\", and features the voices of Owen Wilson, Larry the Cable Guy, Michael Caine, Emily Mortimer, John Turturro, and Eddie Izzard. In the film, race car Lightning McQueen and tow truck Mater head to Japan and Europe to compete in the World Grand Prix, but Mater becomes sidetracked with international espionage. The film\n\nDocument (Title: Into the Woods (film)): Into the Woods (film)\nInto the Woods is a 2014 American musical fantasy film directed by Rob Marshall, and adapted to the screen by James Lapine from his and Stephen Sondheim's 1986 Broadway musical of the same name. A Walt Disney Pictures production, it features an ensemble cast that includes Meryl Streep, Emily Blunt, James Corden, Anna Kendrick, Chris Pine, Tracey Ullman, Christine Baranski, Lilla Crawford, Daniel Huttlestone, MacKenzie Mauzy, Billy Magnussen, and Johnny Depp. Inspired by the Grimm Brothers'\n\nQuestion: Which film was released first, Cars 2 or Into the Woods?\nAnswer: Cars 2\n\nDocument (Title: Rudolf Höss): Rudolf Höss\nRudolf Franz Ferdinand Höss (also Höß, Hoeß or Hoess; 25 November 1901 – 16 April 1947) was a German SS functionary during the Nazi era. He was the longest-serving commandant of Auschwitz concentration and extermination camp. He tested and implemented various methods to accelerate Hitler's plan to systematically exterminate the Jewish population of Nazi-occupied Europe, known as the \"Final Solution\". On the initiative of one of his subordinates, Karl Fritzsch, Höss introduced pesticide Zyklon B containing hydrogen cyanide into the\n\nDocument (Title: Hanns and Rudolf): Hanns and Rudolf\nHanns and Rudolf is a dual biography of Hanns Alexander and Rudolf Höss by the British <skip>  actress.\nCareer.\nWallace began her acting career in 2005. She has appeared in episodes of the television series \"Judging Amy\" (2005), \"Grey's Anatomy\" (2006), \"Cold Case\" (2008), \"Boston Legal\" (2008), \"Glee\" (2009, 2013), \"Ghost Whisperer\" (2010), \"Workaholics\" (2012), \"Rizzoli & Isles\"\n\nDocument (Title: IZombie (TV series)): by Deadboy & the Elephantmen.\nOn October 5, 2015, The CW ordered five additional scripts for the second season; however, on November 23, 2015, the network ordered six additional episodes into production, bringing the season order to 19 episodes.\nProduction Casting.\nAlexandra Krosney originally played the part of Peyton Charles. After the series was ordered, she was replaced by Aly Michalka, and the role was changed from regular cast to recurring. Michalka was later promoted to series regular for the series' third season\n\nDocument (Title: Brittany Ishibashi): Brittany Ishibashi\nBrittany Mariko Ishibashi (born November 2, 1980) is an American film and television actress, best known for her roles as Anne Ogami on the USA Network miniseries \"Political Animals\" and Maggie Zeddmore in the \"Supernatural\" web series \"Ghostfacers\". Ishibashi portrayed Karai in \"\", the sequel to \"Teenage Mutant Ninja Turtles\" and currently portrays Tina Minoru on \"Runaways\", streaming on Hulu.\nEarly life.\nIshibashi was born and raised in Orange County, California and comes from\n\nDocument (Title: Meredith Deane): Meredith Deane\nMeredith Deane (born August 9, 1989) is an American child actress most known for her role as Zoe Manning in the TV show \"Once and Again\". She recently starred in the \"Law & Order\" episode \"Profiteer\" as Ashlee. She starred as Meredith in \"The Loser\" a home production she did with her family. This is on youtube and published by Gabe Jacobs.\nDeane attended the prestigious Dalton School in New York City. She graduated in 2007 and was a freshman\n\nQuestion: Who created the series broadcast on the WB that Leigh-Allyn Baker had a recurring role on?\nAnswer:",
    "metrics": {
      "streamingllm_f1": 0,
      "baseline_f1": 1.0
    }
  }
]